[
  {
    "name": "Ibuprofen",
    "brand": "Advil",
    "description": "Ibuprofen is a nonsteroidal anti-inflammatory drug (NSAID) that is widely used to alleviate pain, reduce fever, and diminish inflammation. It works by inhibiting the production of prostaglandins, chemicals in the body that trigger pain and inflammation. This medication is commonly employed for a range of conditions, from minor aches and pains to more significant discomfort related to arthritis, muscle strains, or injuries.",
    "dosage": "For adults, the typical dosage is 200-400 mg taken every 4 to 6 hours as needed. It is important not to exceed 1200 mg per day without prior consultation with a healthcare professional. Patients are advised to start with the lowest effective dose and adjust based on the severity of symptoms, always adhering to the specific recommendations provided by their doctor or the medication packaging.",
    "sideEffects": "Common side effects include nausea, dizziness, headache, and stomach upset. In some instances, individuals may also experience mild gastrointestinal discomfort, such as heartburn or indigestion. More rarely, serious side effects like gastrointestinal bleeding, ulceration, kidney impairment, or allergic reactions can occur. If any side effects become severe or persist, it is important to seek medical advice promptly.",
    "importantInfo": "It is recommended to take ibuprofen with food or milk to help reduce the risk of stomach irritation. Avoid combining this medication with other NSAIDs, as this can increase the risk of gastrointestinal bleeding and other complications. Prolonged or excessive use may elevate the risk of cardiovascular events, such as heart attack or stroke, as well as potentially impair kidney function. Always consult a healthcare provider before starting, stopping, or altering the dosage, particularly if you have pre-existing health conditions or are taking other medications."
  },
  {
    "name": "Paracetamol",
    "brand": "Tylenol",
    "description": "Paracetamol is used to treat fever and mild to moderate pain.",
    "dosage": "500-1000 mg every 4 to 6 hours. Do not exceed 4000 mg in 24 hours.",
    "sideEffects": "Rare but may include allergic reactions, rash, or liver issues with high doses.",
    "importantInfo": "Can be taken with or without food. Avoid alcohol while using. High doses may cause liver damage. Use caution if consuming other medications with paracetamol."
  },
  {
    "name": "Amoxicillin",
    "brand": "Moxatag",
    "description": "Amoxicillin is an antibiotic used to treat a variety of bacterial infections.",
    "dosage": "250-500 mg every 8 hours or as prescribed by a doctor.",
    "sideEffects": "Diarrhea, nausea, skin rash, headache",
    "importantInfo": "Take with or without food. Complete the full course of treatment. Do not skip doses. Inform your doctor of allergies to penicillin."
  }
]
