[
  {
    "name": "Aciclovir (Zovirax)",
    "brand": "Zovirax, Acyclovir, Herpex, Acivir, Lovir.",
    "description": "Aciclovir is an antiviral medication used to treat infections caused by certain types of viruses. It is most commonly used to treat herpes simplex virus infections, including genital herpes, cold sores, and shingles.",
    "dosage": "Adults: 200 mg five times a day for 5 days for herpes simplex.\n\nShingles: 800 mg five times a day for 7 days.\n\nChildren dosage depends on weight and indication. Always follow doctor’s advice.",
    "sideEffects": "Common: nausea, diarrhea, headache.\n\nRare: confusion, hallucinations, skin rash or itching.",
    "importantInfo": "Start treatment as soon as symptoms appear. Stay well hydrated. Inform your doctor if you have kidney issues or are pregnant. Do not skip doses."
  },
  {
    "name": "Acrivastine",
    "brand": "Benadryl Allergy Relief, Acrivastine & Pseudoephedrine.",
    "description": "Acrivastine is an antihistamine used to relieve symptoms of allergies such as hay fever, urticaria (hives), and insect bites. It works by blocking histamine, a substance in the body that causes allergic symptoms.",
    "dosage": "Adults and children over 12: One 8 mg capsule up to three times daily.\n\nNot recommended for children under 12 years.",
    "sideEffects": "Drowsiness, dry mouth, dizziness, and nausea are common.\n\nSerious reactions are rare but may include allergic rash or difficulty breathing.",
    "importantInfo": "Avoid alcohol while taking this medicine. May cause drowsiness—do not drive or operate machinery if affected. Consult a doctor if symptoms persist."
  },
  {
    "name": "Adalimumab",
    "brand": "Humira, Amgevita, Hyrimoz, Idacio, Imraldi.",
    "description": "Adalimumab is a biologic medication used to treat autoimmune conditions like rheumatoid arthritis, Crohn's disease, psoriasis, and ulcerative colitis by blocking TNF-alpha.",
    "dosage": "Given as a subcutaneous injection. Dosage varies by condition: commonly 40 mg every other week.\n\nExact regimen must be prescribed by a healthcare provider.",
    "sideEffects": "Common: injection site reactions, upper respiratory infections.\n\nSerious: risk of serious infections, liver problems, allergic reactions, blood disorders.",
    "importantInfo": "Regular monitoring with blood tests may be required. Avoid live vaccines during treatment. Notify your doctor of any signs of infection or if you're planning surgery."
  },
  {
    "name": "Alendronic acid",
    "brand": "Fosamax, Binosto, Alendronate.",
    "description": "Alendronic acid is used to treat and prevent osteoporosis by slowing down the process of bone loss. It helps to maintain strong bones and reduce the risk of fractures.",
    "dosage": "Typical dose is 70 mg once weekly or 10 mg once daily.\n\nMust be taken on an empty stomach with water, at least 30 minutes before food or drink.\n\nRemain upright for 30 minutes after taking.",
    "sideEffects": "Common: stomach pain, heartburn, indigestion, constipation or diarrhea.\n\nRare: jaw bone problems (osteonecrosis), unusual thigh bone fractures.",
    "importantInfo": "Do not lie down after taking. Take with a full glass of plain water only. Notify your dentist before procedures. Ensure sufficient calcium and vitamin D intake."
  },
  {
    "name": "Allopurinol",
    "brand": "Zyloric, Allohexal, Progout, Milurit.",
    "description": "Allopurinol is used to treat gout and kidney stones by reducing the production of uric acid in the body. It is also prescribed to prevent increased uric acid levels during cancer treatment.",
    "dosage": "Initial dose: 100 mg daily, increased gradually based on uric acid levels.\n\nTypical maintenance: 200–600 mg daily in divided doses.\n\nEnsure adequate fluid intake while using.",
    "sideEffects": "Common: skin rash, nausea, diarrhea.\n\nRare but serious: hypersensitivity syndrome, liver abnormalities, bone marrow suppression.",
    "importantInfo": "Take after meals to reduce stomach upset. Stop immediately and seek help if rash develops. Monitor uric acid levels regularly. Dose adjustments may be needed in kidney impairment."
  },
  {
    "name": "Alogliptin",
    "brand": "Vipidia.",
    "description": "Alogliptin is an oral medication used to treat type 2 diabetes. It works by increasing insulin release and lowering glucagon levels in the blood, especially after meals.",
    "dosage": "Standard dose: 25 mg once daily, with or without food.\n\nLower doses may be recommended for patients with kidney problems.",
    "sideEffects": "Common: headache, upper respiratory tract infection, nausea.\n\nRare: pancreatitis, joint pain, allergic reactions.",
    "importantInfo": "Not for type 1 diabetes or diabetic ketoacidosis. Regular blood sugar monitoring is advised. Inform your doctor of any severe stomach pain or rash."
  },
  {
    "name": "Amitriptyline",
    "brand": "Elavil, Tryptizol, Laroxyl, Saroten.",
    "description": "Amitriptyline is a tricyclic antidepressant used for depression, nerve pain, and sometimes migraine prevention. It alters chemical signals in the brain to improve mood and reduce pain.",
    "dosage": "For depression: 50–100 mg daily, adjusted based on response.\n\nFor nerve pain or migraine: 10–75 mg at night.\n\nStart at low dose and titrate slowly.",
    "sideEffects": "Drowsiness, dry mouth, weight gain, constipation.\n\nMay cause dizziness, blurred vision, or trouble urinating.",
    "importantInfo": "Avoid alcohol and driving until effects are known. Do not stop suddenly without medical advice. Can interact with other antidepressants and medications."
  },
  {
    "name": "Amlodipine",
    "brand": "Norvasc, Istin, Amlostin.",
    "description": "Amlodipine is a calcium channel blocker used to treat high blood pressure and angina. It works by relaxing blood vessels, allowing blood to flow more easily and reducing heart workload.",
    "dosage": "Initial dose: 5 mg once daily.\n\nMay be increased to 10 mg daily depending on response and tolerance.",
    "sideEffects": "Common: swelling of ankles, headache, flushing, dizziness.\n\nLess common: palpitations, fatigue, nausea.",
    "importantInfo": "Take at the same time each day. May take several weeks to see full effect. Do not stop abruptly without consulting your doctor."
  },
  {
    "name": "Amoxicillin",
    "brand": "Amoxil, Trimox, Moxatag.",
    "description": "Amoxicillin is a penicillin-type antibiotic used to treat a variety of bacterial infections, including ear infections, throat infections, urinary tract infections, and pneumonia.",
    "dosage": "Typical adult dose: 250–500 mg every 8 hours, or 500–875 mg every 12 hours depending on severity.\n\nChildren: dosage based on weight and infection type.",
    "sideEffects": "Common: nausea, diarrhea, skin rash.\n\nRare: allergic reactions, including anaphylaxis or Stevens-Johnson syndrome.",
    "importantInfo": "Complete the full course even if symptoms improve early.\n\nNotify your doctor if you develop a rash or signs of allergy.\n\nCan affect oral contraceptive effectiveness."
  },
  {
    "name": "Anastrozole",
    "brand": "Arimidex.",
    "description": "Anastrozole is used to treat breast cancer in postmenopausal women. It works by lowering estrogen levels, which can help shrink hormone receptor-positive tumors.",
    "dosage": "1 mg once daily, taken at the same time each day.\n\nTreatment duration varies based on cancer type and patient response.",
    "sideEffects": "Common: hot flushes, joint pain, weakness.\n\nMay also cause bone thinning, mood changes, or nausea.",
    "importantInfo": "Regular bone density monitoring may be required.\n\nTell your doctor if you have osteoporosis or liver issues.\n\nNot for use in premenopausal women or during pregnancy."
  },
  {
    "name": "Antidepressants",
    "brand": "Includes SSRIs (e.g., sertraline), SNRIs (e.g., venlafaxine), TCAs (e.g., amitriptyline), MAOIs, and atypical agents.",
    "description": "Antidepressants are a class of medications used to treat depression, anxiety disorders, PTSD, and other mental health conditions. They work by altering brain chemicals like serotonin and norepinephrine.",
    "dosage": "Dosage varies greatly depending on the specific drug and individual condition.\n\nTypically started at a low dose and adjusted slowly.",
    "sideEffects": "Common: nausea, dry mouth, drowsiness, insomnia, sexual dysfunction.\n\nSome may cause weight gain or increased anxiety at the start.",
    "importantInfo": "Do not stop abruptly—may lead to withdrawal symptoms.\n\nIt may take 2–6 weeks to feel full effect.\n\nMonitor for worsening mood or suicidal thoughts, especially early in treatment."
  },
  {
    "name": "Apixaban",
    "brand": "Eliquis.",
    "description": "Apixaban is a direct oral anticoagulant (DOAC) used to prevent and treat blood clots, including in conditions like deep vein thrombosis (DVT), pulmonary embolism, and atrial fibrillation.",
    "dosage": "Typical dose: 5 mg twice daily.\n\nMay be reduced to 2.5 mg twice daily in elderly or those with kidney impairment.",
    "sideEffects": "Common: bleeding, bruising, nausea.\n\nRare: allergic reactions, liver enzyme changes.",
    "importantInfo": "Do not stop without medical advice.\n\nAvoid NSAIDs and other blood thinners unless instructed.\n\nNo routine blood monitoring required, but regular review is important."
  },
  {
    "name": "Aripiprazole",
    "brand": "Abilify, Aripiprex, Arisera, Abiza, Arpizol.",
    "description": "Aripiprazole is an antipsychotic medication used to treat schizophrenia, bipolar disorder, and as an adjunct for major depressive disorder. It works by balancing dopamine and serotonin in the brain.",
    "dosage": "Typical adult dose: 10–15 mg once daily, adjustable up to 30 mg based on response.\n\nLower doses may be used for depression augmentation.",
    "sideEffects": "Common: insomnia, restlessness, nausea, anxiety.\n\nRare: movement disorders, elevated blood sugar, suicidal thoughts.",
    "importantInfo": "Avoid alcohol and monitor for behavior changes.\n\nMay impair judgment or coordination.\n\nTapering may be required when stopping."
  },
  {
    "name": "Aspirin",
    "brand": "Disprin, Aspro, Bayer, Nu-Seals, Micropirin.",
    "description": "Aspirin is an anti-inflammatory and antiplatelet drug used for pain relief, fever, and heart attack/stroke prevention. It inhibits prostaglandins and platelet aggregation.",
    "dosage": "For pain: 300–600 mg every 4–6 hours as needed.\n\nFor cardiovascular protection: 75–150 mg once daily.",
    "sideEffects": "Common: stomach upset, heartburn, mild bleeding.\n\nRare: ulcers, allergic reactions, bleeding disorders.",
    "importantInfo": "Take with food or milk to reduce stomach irritation.\n\nAvoid with other NSAIDs or blood thinners unless advised.\n\nNot suitable for children under 16 (Reye’s syndrome risk)."
  },
  {
    "name": "Atenolol",
    "brand": "Tenormin, Betacard, Atehexal, Hypoten, Noten.",
    "description": "Atenolol is a beta-blocker used to treat high blood pressure, angina, and arrhythmias. It reduces heart rate and cardiac output, easing strain on the heart.",
    "dosage": "Typical dose: 25–100 mg once daily.\n\nDose may be split or adjusted based on blood pressure response.",
    "sideEffects": "Common: fatigue, cold extremities, dizziness.\n\nMay cause slow heart rate, sleep disturbances, or sexual dysfunction.",
    "importantInfo": "Do not stop abruptly—may worsen heart conditions.\n\nUse with caution in asthma, diabetes, or circulation problems.\n\nMonitor heart rate and blood pressure regularly."
  },
  {
    "name": "Atorvastatin",
    "brand": "Lipitor, Atorlip, Torvacard, Sortis, Tulip.",
    "description": "Atorvastatin is a statin used to lower cholesterol and reduce cardiovascular risk. It inhibits HMG-CoA reductase, decreasing LDL cholesterol production in the liver.",
    "dosage": "Initial dose: 10–20 mg once daily.\n\nMaximum dose: 80 mg daily, adjusted based on cholesterol targets.",
    "sideEffects": "Common: muscle aches, headache, digestive issues.\n\nRare: liver enzyme elevation, muscle breakdown (rhabdomyolysis).",
    "importantInfo": "Avoid grapefruit juice.\n\nLiver function should be monitored during treatment.\n\nReport any unexplained muscle pain or weakness."
  },
  {
    "name": "Azathioprine",
    "brand": "Imuran, Azapress, Azamun, Imurel, Azathioprine Sandoz.",
    "description": "Azathioprine is an immunosuppressant used in autoimmune diseases such as rheumatoid arthritis, Crohn's disease, and after organ transplants. It works by reducing immune system activity.",
    "dosage": "Typically 1–3 mg/kg per day depending on condition and body weight.\n\nDosage is often adjusted based on white blood cell counts and liver function.",
    "sideEffects": "Common: nausea, loss of appetite, increased infection risk.\n\nSerious: liver damage, bone marrow suppression, pancreatitis.",
    "importantInfo": "Requires regular blood tests to monitor liver function and blood cell counts.\n\nAvoid live vaccines during treatment.\n\nInform your doctor about TPMT deficiency if known."
  },
  {
    "name": "Azithromycin",
    "brand": "Zithromax, Azasite, Azee, Azomycin, Zmax.",
    "description": "Azithromycin is a macrolide antibiotic used to treat respiratory infections, skin infections, sexually transmitted infections, and ear infections.",
    "dosage": "Typical adult dose: 500 mg on day 1, then 250 mg daily for 4 days.\n\nSTIs: single 1 g dose.\n\nPediatric dosing based on weight.",
    "sideEffects": "Common: nausea, diarrhea, abdominal pain.\n\nLess common: liver enzyme elevation, QT prolongation, allergic reactions.",
    "importantInfo": "Take at least 1 hour before or 2 hours after meals if using tablets.\n\nMay interact with antacids or heart rhythm medications.\n\nComplete the full course even if symptoms improve."
  },
  {
    "name": "Baclofen",
    "brand": "Lioresal, Gablofen, Kemstro, Baclosan, Baclin.",
    "description": "Baclofen is a muscle relaxant used to treat spasticity from conditions like multiple sclerosis or spinal cord injuries. It works by suppressing nerve signals in the spinal cord.",
    "dosage": "Initial dose: 5 mg three times daily, increased gradually up to 80 mg/day if needed.\n\nDose must be adjusted slowly to avoid side effects.",
    "sideEffects": "Drowsiness, dizziness, weakness, fatigue.\n\nIn high doses: confusion, low blood pressure, breathing issues.",
    "importantInfo": "Do not stop suddenly—may cause withdrawal.\n\nCaution with alcohol or other CNS depressants.\n\nUse with care in elderly or those with kidney impairment."
  },
  {
    "name": "Beclometasone",
    "brand": "Qvar, Clenil Modulite, Beconase, Becotide, Inhace.",
    "description": "Beclometasone is a corticosteroid used to treat asthma, allergic rhinitis, and other inflammatory conditions. It reduces swelling and irritation in the airways or nasal passages.",
    "dosage": "Inhaler: 100–400 mcg twice daily depending on severity.\n\nNasal spray: 100–200 mcg per nostril daily for allergies.",
    "sideEffects": "Hoarseness, sore throat, cough, oral thrush.\n\nLong-term high doses may suppress adrenal function.",
    "importantInfo": "Rinse mouth after inhaler use to prevent thrush.\n\nDo not use for sudden asthma attacks—use a reliever inhaler.\n\nFollow tapering instructions if discontinuing high doses."
  },
  {
    "name": "Bendroflumethiazide",
    "brand": "Aprinox, Centyl, Bendrofluazide, Bendrosone, Neo-NaClex.",
    "description": "Bendroflumethiazide is a thiazide diuretic used to treat high blood pressure and fluid retention. It helps reduce excess fluid and salt by increasing urine output.",
    "dosage": "For hypertension: 2.5 mg once daily.\n\nFor edema: 5–10 mg once daily, adjusted as needed.",
    "sideEffects": "Dizziness, low potassium, dehydration, muscle cramps.\n\nMay increase blood sugar or uric acid levels.",
    "importantInfo": "Monitor electrolytes and kidney function.\n\nMay increase sun sensitivity—use sunscreen.\n\nTake in the morning to avoid nighttime urination."
  },
  {
    "name": "Benzoyl peroxide",
    "brand": "Acnecide, PanOxyl, Benzac, Brevoxyl, Benacne.",
    "description": "Benzoyl peroxide is a topical antibacterial used to treat acne. It works by killing bacteria on the skin and helping to unclog pores.",
    "dosage": "Apply a thin layer once or twice daily to affected areas after cleansing.\n\nStart with lower strengths to minimize irritation.",
    "sideEffects": "Dryness, redness, peeling, stinging.\n\nMay bleach hair or fabrics it comes into contact with.",
    "importantInfo": "Avoid contact with eyes, mouth, and mucous membranes.\n\nUse sunscreen—skin may be more sensitive to sun.\n\nAllow 4–6 weeks to see full benefit."
  },
  {
    "name": "Benzydamine",
    "brand": "Difflam, Tantum Verde, Benzydox, Benzoral, Tantum.",
    "description": "Benzydamine is a local anti-inflammatory and analgesic used for mouth and throat pain, such as sore throat, mouth ulcers, or post-dental procedures.",
    "dosage": "Mouthwash: rinse 15 ml every 1.5–3 hours, up to 8 times daily.\n\nSpray: 4–8 puffs every 1.5–3 hours, as needed.",
    "sideEffects": "Numbness, tingling, stinging.\n\nRarely: allergic reactions or mouth irritation.",
    "importantInfo": "Do not swallow mouthwash.\n\nAvoid eating or drinking immediately after use.\n\nStop use if signs of sensitivity or allergy occur."
  },
  {
    "name": "Betahistine",
    "brand": "Serc, Betaserc, Vergo, Betavert, Vazoserc.",
    "description": "Betahistine is used to treat vertigo and balance disorders such as Ménière’s disease. It works by improving blood flow in the inner ear.",
    "dosage": "Usual dose: 16 mg three times daily or 24 mg twice daily.\n\nMay take a few weeks for full effect.",
    "sideEffects": "Nausea, headache, indigestion.\n\nOccasionally: rash or allergic reaction.",
    "importantInfo": "Take with food to reduce stomach upset.\n\nContinue taking regularly for best results.\n\nInform your doctor if symptoms persist or worsen."
  },
  {
    "name": "Betamethasone",
    "brand": "Betnovate, Diprosone, Celestone, Alphatrex, Luxiq.",
    "description": "Betamethasone is a potent corticosteroid used to treat inflammatory skin conditions such as eczema, psoriasis, and dermatitis. It reduces redness, itching, and swelling.",
    "dosage": "Apply a thin layer once or twice daily to affected area.\n\nDo not use on large areas or under dressings unless advised.",
    "sideEffects": "Skin thinning, stretch marks, burning or stinging.\n\nProlonged use may lead to hormonal side effects or infection.",
    "importantInfo": "Use sparingly and only for short periods unless instructed.\n\nAvoid use on face or broken skin unless prescribed.\n\nDo not suddenly stop long-term use—taper as advised."
  },
  {
    "name": "Bimatoprost (Lumigan)",
    "brand": "Lumigan, Latisse, Bimat, Careprost, Bimato.",
    "description": "Bimatoprost is an eye drop used to lower intraocular pressure in conditions like glaucoma or ocular hypertension. It increases fluid drainage from the eye.",
    "dosage": "One drop into the affected eye(s) once daily, typically in the evening.\n\nDo not exceed recommended frequency.",
    "sideEffects": "Redness, eyelash growth, darkening of the eyelid or iris.\n\nPossible eye irritation or dryness.",
    "importantInfo": "Remove contact lenses before use and wait 15 minutes before reinserting.\n\nAvoid touching dropper tip to any surface.\n\nTell your doctor if you have eye infections or swelling."
  },
  {
    "name": "Bisacodyl",
    "brand": "Dulcolax, Fleet Laxative, Muxol, Alophen, Carter's Little Pills.",
    "description": "Bisacodyl is a stimulant laxative used to relieve occasional constipation. It works by stimulating bowel movements through irritation of the intestinal lining.",
    "dosage": "Oral: 5–10 mg once daily as needed.\n\nSuppository: 10 mg rectally, typically effective within 15–60 minutes.",
    "sideEffects": "Abdominal cramps, diarrhea, nausea.\n\nProlonged use may cause electrolyte imbalance or dependency.",
    "importantInfo": "Take oral tablets with water and do not crush or chew.\n\nDo not use for more than 5 consecutive days.\n\nStay hydrated and maintain dietary fiber intake."
  },
  {
    "name": "Bisoprolol",
    "brand": "Concor, Zebeta, Bisocard, Biselect, Bisoprolol Mylan.",
    "description": "Bisoprolol is a beta-blocker used to manage high blood pressure, heart failure, and angina. It slows the heart rate and reduces strain on the heart.",
    "dosage": "Initial dose: 5 mg once daily.\n\nMay be adjusted between 2.5–20 mg daily based on response.",
    "sideEffects": "Fatigue, cold hands/feet, slow heartbeat.\n\nPossible dizziness, sleep issues, or shortness of breath.",
    "importantInfo": "Do not stop suddenly—risk of heart complications.\n\nCaution in asthma, diabetes, or heart block.\n\nTake at the same time each day, with or without food."
  },
  {
    "name": "Brinzolamide",
    "brand": "Azopt, Simbrinza (with brimonidine), Brinzoft, Bryzoft, Optri.",
    "description": "Brinzolamide is a carbonic anhydrase inhibitor used in the form of eye drops to reduce intraocular pressure in glaucoma and ocular hypertension.",
    "dosage": "One drop in the affected eye(s) twice daily.\n\nIf used with other eye drops, space doses at least 10 minutes apart.",
    "sideEffects": "Blurred vision, bitter taste, dry eyes.\n\nLess commonly: eye discomfort, headache, or allergic reaction.",
    "importantInfo": "Shake well before use.\n\nDo not touch the dropper tip to your eye or any surface.\n\nContact lenses should be removed before application and reinserted after 15 minutes."
  },
  {
    "name": "Budesonide",
    "brand": "Pulmicort, Rhinocort, Entocort, Budenofalk, Symbicort (combo).",
    "description": "Budesonide is a corticosteroid used for asthma, Crohn’s disease, ulcerative colitis, and allergic rhinitis. It reduces inflammation in the airways or gastrointestinal tract.",
    "dosage": "Inhaler: 200–800 mcg daily in divided doses.\n\nFor IBD: 9 mg once daily in the morning, typically for up to 8 weeks.",
    "sideEffects": "Hoarseness, oral thrush, headache.\n\nRare: adrenal suppression, slowed growth in children.",
    "importantInfo": "Rinse mouth after inhalation to prevent thrush.\n\nDo not use inhaler as a rescue medication.\n\nTaper slowly if stopping long-term use."
  },
  {
    "name": "Bumetanide",
    "brand": "Burinex, Bumex, Bumesyn.",
    "description": "Bumetanide is a loop diuretic used to treat fluid overload (edema) in conditions like heart failure, liver disease, or kidney disease by increasing urine output.",
    "dosage": "Typical dose: 0.5–2 mg once daily.\n\nMay be given in divided doses depending on response.",
    "sideEffects": "Frequent urination, low potassium, dizziness.\n\nMay cause dehydration or changes in blood pressure.",
    "importantInfo": "Monitor electrolytes and kidney function.\n\nTake in the morning to avoid nighttime urination.\n\nStand up slowly to prevent dizziness."
  },
  {
    "name": "Buprenorphine",
    "brand": "Subutex, Suboxone (with naloxone), Butrans, Temgesic, Norspan.",
    "description": "Buprenorphine is a partial opioid agonist used for pain relief and opioid dependence. It helps reduce withdrawal symptoms and cravings.",
    "dosage": "For opioid dependence: 2–8 mg sublingually daily, adjusted as needed.\n\nFor pain: transdermal patches changed weekly or sublingual tablets as directed.",
    "sideEffects": "Constipation, dizziness, drowsiness, headache.\n\nSerious: respiratory depression, dependence, liver enzyme changes.",
    "importantInfo": "Avoid alcohol and other sedatives.\n\nDo not cut patches or stop suddenly.\n\nMust be prescribed and monitored under medical supervision."
  },
  {
    "name": "Buscopan (hyoscine butylbromide)",
    "brand": "Buscopan, Scopolan, Hyospasmol, Colofac IBS, Spasmopriv.",
    "description": "Buscopan is an antispasmodic used to relieve abdominal cramps, irritable bowel syndrome (IBS), and menstrual pain. It works by relaxing smooth muscles in the gut.",
    "dosage": "Usual adult dose: 10 mg three times a day.\n\nCan be increased to 20 mg four times daily for severe symptoms.",
    "sideEffects": "Dry mouth, dizziness, blurred vision.\n\nRare: urinary retention, allergic reactions.",
    "importantInfo": "Do not use if you have glaucoma or myasthenia gravis.\n\nAvoid alcohol if it increases drowsiness.\n\nTell your doctor if symptoms persist or worsen."
  },
  {
    "name": "Calcipotriol",
    "brand": "Dovonex, Daivonex, Sorvate, Psorcutan, Calcitrene.",
    "description": "Calcipotriol is a vitamin D analogue used topically to treat plaque psoriasis. It slows down the growth of skin cells and reduces scaling.",
    "dosage": "Apply a thin layer to affected areas once or twice daily.\n\nDo not use more than 100 g per week in adults.",
    "sideEffects": "Skin irritation, redness, itching.\n\nRare: hypercalcemia with excessive use.",
    "importantInfo": "Avoid use on face, flexures, or broken skin.\n\nDo not use with calcium supplements unless advised.\n\nWash hands after application unless treating hands."
  },
  {
    "name": "Candesartan",
    "brand": "Atacand, Blopress, Candesar, Carten, Amias.",
    "description": "Candesartan is an angiotensin II receptor blocker (ARB) used to treat high blood pressure and heart failure. It helps relax blood vessels and lower blood pressure.",
    "dosage": "Hypertension: 8–32 mg once daily.\n\nHeart failure: starting dose 4 mg daily, titrated up based on response.",
    "sideEffects": "Dizziness, headache, tiredness.\n\nRare: low blood pressure, kidney problems, high potassium.",
    "importantInfo": "Monitor kidney function and potassium levels.\n\nNot recommended during pregnancy.\n\nTake at the same time each day, with or without food."
  },
  {
    "name": "Carbamazepine",
    "brand": "Tegretol, Carbatrol, Epitol, Mazepine, Finlepsin.",
    "description": "Carbamazepine is an anticonvulsant used to treat epilepsy, trigeminal neuralgia, and bipolar disorder. It stabilizes nerve activity in the brain.",
    "dosage": "Initial dose: 100–200 mg once or twice daily.\n\nMaintenance: 800–1,200 mg daily in divided doses, based on condition and response.",
    "sideEffects": "Drowsiness, dizziness, nausea, unsteadiness.\n\nSerious: liver issues, blood disorders, severe skin reactions.",
    "importantInfo": "Requires regular blood and liver tests.\n\nMay reduce effectiveness of oral contraceptives.\n\nDo not stop suddenly—risk of seizures."
  },
  {
    "name": "Carbimazole",
    "brand": "Neo-Mercazole, Carzimole, Thyromazole, Karbimazole, Carbzole.",
    "description": "Carbimazole is used to treat hyperthyroidism by reducing the production of thyroid hormones. It is commonly prescribed in Graves' disease.",
    "dosage": "Initial dose: 15–40 mg daily, usually divided into 2–3 doses.\n\nMaintenance: 5–15 mg once daily depending on thyroid function tests.",
    "sideEffects": "Rash, joint pain, nausea.\n\nRare but serious: agranulocytosis, liver dysfunction.",
    "importantInfo": "Report sore throat, fever, or mouth ulcers immediately — may indicate low white blood cells.\n\nRegular blood tests are required.\n\nNot recommended during pregnancy unless under specialist care."
  },
  {
    "name": "Carbocisteine",
    "brand": "Mucodyne, Rhinathiol, Bronchokod, Exomuc, Mucomyst.",
    "description": "Carbocisteine is a mucolytic agent used to thin and loosen mucus in the airways, making it easier to cough up. It is used in chronic respiratory conditions like COPD.",
    "dosage": "Adults: 750 mg three times daily, reduced to 500 mg three times once improvement is seen.\n\nChildren’s doses depend on age and weight.",
    "sideEffects": "Nausea, diarrhea, stomach discomfort.\n\nRare: skin rash or allergic reaction.",
    "importantInfo": "Take with plenty of fluid.\n\nAvoid in active peptic ulcers.\n\nMay take a few days to show full benefit."
  },
  {
    "name": "Carmellose",
    "brand": "Celluvisc, Refresh Tears, Optive, Viscotears, Lacri-Lube.",
    "description": "Carmellose (carboxymethylcellulose) is an eye lubricant used to relieve dry eyes and irritation caused by wind, sun, computer use, or certain medications.",
    "dosage": "Instill 1 or 2 drops in the affected eye(s) as needed.\n\nCan be used several times a day depending on symptoms.",
    "sideEffects": "Temporary blurred vision, eye discomfort, stinging.\n\nRare: allergic reactions.",
    "importantInfo": "Do not touch dropper tip to any surface.\n\nRemove contact lenses before use.\n\nWait 10–15 minutes before using other eye medications."
  },
  {
    "name": "Carvedilol",
    "brand": "Coreg, Dilatrend, Eucardic, Carloc, Carvetrend.",
    "description": "Carvedilol is a beta-blocker used to treat high blood pressure, heart failure, and angina. It reduces heart rate and improves heart function.",
    "dosage": "Hypertension: 12.5–50 mg daily in divided doses.\n\nHeart failure: start with 3.125 mg twice daily, gradually increased as tolerated.",
    "sideEffects": "Fatigue, dizziness, slow heart rate, low blood pressure.\n\nMay cause weight gain or worsen breathing in some patients.",
    "importantInfo": "Take with food to reduce dizziness.\n\nDo not stop suddenly—may worsen heart conditions.\n\nMonitor blood pressure and pulse regularly."
  },
  {
    "name": "Cefalexin",
    "brand": "Keflex, Ceporex, Rancef, Sporidex, Ospexin.",
    "description": "Cefalexin is a cephalosporin antibiotic used to treat bacterial infections including skin infections, respiratory tract infections, and urinary tract infections.",
    "dosage": "Adults: 250–500 mg every 6 hours, or 500 mg every 12 hours.\n\nChildren: 25–50 mg/kg per day in divided doses.",
    "sideEffects": "Nausea, diarrhea, abdominal pain.\n\nRare: allergic reactions, including rash or anaphylaxis.",
    "importantInfo": "Complete the full course even if symptoms improve.\n\nTake with or without food.\n\nInform your doctor if you are allergic to penicillin or cephalosporins."
  },
  {
    "name": "Cetirizine",
    "brand": "Zyrtec, Benadryl Allergy One-a-day, Cetrine, Zirtek, Piriteze.",
    "description": "Cetirizine is a non-drowsy antihistamine used for hay fever, hives, insect bites, and other allergic reactions. It works by blocking histamine receptors.",
    "dosage": "Adults and children over 12: 10 mg once daily.\n\nChildren 6–12: 5 mg twice daily.\n\nNot recommended for children under 6 unless advised.",
    "sideEffects": "Drowsiness, dry mouth, headache.\n\nRare: stomach upset, rash, allergic reaction.",
    "importantInfo": "Avoid alcohol if it increases drowsiness.\n\nCan be taken with or without food.\n\nDo not exceed the recommended dose."
  },
  {
    "name": "Chloramphenicol",
    "brand": "Chloromycetin, Optrex Infected Eye, Cpl Eye Drops, Golden Eye, Minims.",
    "description": "Chloramphenicol is a broad-spectrum antibiotic used in eye drops and ointments to treat bacterial conjunctivitis and other eye infections.",
    "dosage": "Eye drops: 1 drop every 2 hours during waking hours for the first 2 days, then 4 times daily.\n\nOintment: apply 3–4 times daily or at night.",
    "sideEffects": "Temporary stinging or burning.\n\nRare: blurred vision, allergic reactions, bone marrow suppression with prolonged use.",
    "importantInfo": "Do not wear contact lenses during treatment.\n\nDiscard eye drops 5 days after opening.\n\nUse exactly as directed to avoid resistance."
  },
  {
    "name": "Chlorhexidine",
    "brand": "Corsodyl, Peridex, Chlorohex, PerioGard, Curasept.",
    "description": "Chlorhexidine is an antiseptic used in mouthwash, skin cleanser, and wound care products. It kills bacteria and is commonly used to treat or prevent gum disease.",
    "dosage": "Mouthwash: rinse with 10–15 ml twice daily.\n\nTopical: apply a small amount to the affected area as directed.",
    "sideEffects": "Altered taste, mouth irritation, staining of teeth or tongue.\n\nRare: allergic reaction or swelling.",
    "importantInfo": "Avoid eating or drinking immediately after use.\n\nProlonged use can stain teeth—use as directed.\n\nDo not swallow mouthwash."
  },
  {
    "name": "Chlorphenamine (Piriton)",
    "brand": "Piriton, Allerief, Hayleve, Histafen, Chlorphen-12.",
    "description": "Chlorphenamine is a sedating antihistamine used for allergic reactions, hay fever, hives, and insect bites. It works by blocking histamine to reduce symptoms like itching and swelling.",
    "dosage": "Adults: 4 mg every 4–6 hours, max 24 mg/day.\n\nChildren: dosage varies by age — always follow packaging or doctor’s advice.",
    "sideEffects": "Drowsiness, dry mouth, dizziness, blurred vision.\n\nMay cause constipation or difficulty urinating.",
    "importantInfo": "Avoid alcohol and driving.\n\nDo not use with other sedating antihistamines.\n\nUse with caution in asthma, glaucoma, or prostate problems."
  },
  {
    "name": "Cinnarizine",
    "brand": "Stugeron, Cinarizina, Cinnirex, Cinnaz, Cinaron.",
    "description": "Cinnarizine is an antihistamine used to treat nausea, vomiting, vertigo, and motion sickness. It also improves blood flow in conditions like Ménière’s disease.",
    "dosage": "Motion sickness: 30 mg two hours before travel, then 15 mg every 8 hours.\n\nVertigo: 30 mg three times daily.",
    "sideEffects": "Drowsiness, dry mouth, weight gain.\n\nOccasionally: stomach upset or rash.",
    "importantInfo": "Take with or after food to reduce nausea.\n\nMay cause drowsiness — avoid alcohol and driving.\n\nProlonged use should be supervised by a doctor."
  },
  {
    "name": "Ciprofloxacin",
    "brand": "Ciproxin, Ciloxan, Cetraxal, Ciflox, Ciprobay.",
    "description": "Ciprofloxacin is a broad-spectrum antibiotic used for urinary tract infections, respiratory infections, and gastrointestinal infections. It is also used in eye/ear drops.",
    "dosage": "Typical adult oral dose: 250–750 mg twice daily.\n\nDuration depends on infection type and severity.",
    "sideEffects": "Nausea, diarrhea, dizziness, rash.\n\nRare: tendon damage, seizures, mood changes.",
    "importantInfo": "Avoid taking with dairy or calcium supplements.\n\nStay well hydrated and avoid excess sun.\n\nDo not take with NSAIDs unless advised."
  },
  {
    "name": "Citalopram",
    "brand": "Celexa, Cipramil, Citox, Zetalo, Citalect.",
    "description": "Citalopram is a selective serotonin reuptake inhibitor (SSRI) used to treat depression and anxiety disorders by increasing serotonin levels in the brain.",
    "dosage": "Starting dose: 20 mg once daily.\n\nMay be increased to a maximum of 40 mg daily based on response.",
    "sideEffects": "Nausea, dry mouth, drowsiness, sexual dysfunction.\n\nMay initially increase anxiety or agitation.",
    "importantInfo": "Do not stop abruptly — taper slowly under medical supervision.\n\nTakes 2–4 weeks to see full benefit.\n\nAvoid alcohol and monitor for mood changes early in treatment."
  },
  {
    "name": "Clarithromycin",
    "brand": "Klacid, Biaxin, Klaricid, Claritek, Monodrox.",
    "description": "Clarithromycin is a macrolide antibiotic used to treat respiratory infections, skin infections, and stomach ulcers caused by *H. pylori*. It works by stopping the growth of bacteria.",
    "dosage": "Typical adult dose: 250–500 mg twice daily for 7–14 days.\n\nCan be used with other medications for *H. pylori* eradication.",
    "sideEffects": "Nausea, diarrhea, taste changes, headache.\n\nRare: liver enzyme changes, QT prolongation, allergic reactions.",
    "importantInfo": "Can interact with many medications — inform your doctor of all current prescriptions.\n\nTake with or without food.\n\nComplete the course even if symptoms improve."
  },
  {
    "name": "Clobetasol",
    "brand": "Dermovate, Clobex, Temovate, Clobevate, Tenovate.",
    "description": "Clobetasol is a very potent corticosteroid used for severe inflammatory skin conditions such as psoriasis, eczema, or lichen planus. It reduces redness, itching, and swelling.",
    "dosage": "Apply thinly once or twice daily to affected area.\n\nUse for no more than 2–4 weeks unless directed.",
    "sideEffects": "Skin thinning, irritation, burning sensation.\n\nProlonged use may lead to hormonal side effects or stretch marks.",
    "importantInfo": "Do not use on face or broken skin unless advised.\n\nAvoid occlusive dressings unless directed.\n\nWash hands after use unless treating them."
  },
  {
    "name": "Clobetasone",
    "brand": "Eumovate, Trimovate (with antifungal/antibacterial), Clobet.",
    "description": "Clobetasone is a moderate strength steroid used to treat eczema, dermatitis, and other inflammatory skin conditions. It helps to reduce itching and redness.",
    "dosage": "Apply a thin layer once or twice daily.\n\nTreatment should be limited to short periods and reviewed regularly.",
    "sideEffects": "Mild burning or stinging, skin thinning with prolonged use.\n\nRare: allergic rash or folliculitis.",
    "importantInfo": "Avoid long-term use, especially on delicate skin areas.\n\nDo not use on face or genitals unless prescribed.\n\nWash hands after applying."
  },
  {
    "name": "Clonazepam",
    "brand": "Rivotril, Klonopin, Paxam, Clonotril, Clonex.",
    "description": "Clonazepam is a benzodiazepine used to treat seizures, panic disorder, and sometimes movement disorders. It works by calming brain activity.",
    "dosage": "Seizures: initial 0.5 mg three times daily, titrated up as needed.\n\nPanic disorder: 0.25–2 mg daily depending on severity.",
    "sideEffects": "Drowsiness, dizziness, coordination problems.\n\nRisk of dependence, memory issues, or depression with long-term use.",
    "importantInfo": "Avoid alcohol and do not drive until you know how it affects you.\n\nTaper off slowly — stopping suddenly may cause withdrawal or seizures.\n\nUse short term unless advised otherwise."
  },
  {
    "name": "Clonidine",
    "brand": "Catapres, Dixarit, Clophelin, Arkamin, Clofenin.",
    "description": "Clonidine is primarily used to treat high blood pressure, ADHD, and withdrawal symptoms. It works by decreasing nerve signals that tighten blood vessels, lowering blood pressure and calming the nervous system.",
    "dosage": "Hypertension: 100–200 mcg twice daily.\n\nADHD (off-label): starting at 25 mcg at bedtime, titrated slowly.",
    "sideEffects": "Drowsiness, dry mouth, constipation, low blood pressure.\n\nCan cause rebound hypertension if stopped suddenly.",
    "importantInfo": "Do not stop abruptly — always taper off under medical supervision.\n\nTake at the same times each day.\n\nMonitor blood pressure regularly during treatment."
  },
  {
    "name": "Clopidogrel",
    "brand": "Plavix, Clopivas, Deplatt, Ceruvin, Clopidrel.",
    "description": "Clopidogrel is an antiplatelet medication used to prevent blood clots after a heart attack, stroke, or stent placement. It prevents platelets from clumping together.",
    "dosage": "Typical dose: 75 mg once daily.\n\nMay be given with aspirin in dual antiplatelet therapy.",
    "sideEffects": "Bleeding, bruising, diarrhea, rash.\n\nRare: low white blood cells or allergic reactions.",
    "importantInfo": "Avoid NSAIDs unless directed — increases bleeding risk.\n\nTell all healthcare providers you’re taking clopidogrel.\n\nDo not stop without medical advice."
  },
  {
    "name": "Clotrimazole",
    "brand": "Canesten, Lotrimin, Mycelex, Clotrim, Fungoid.",
    "description": "Clotrimazole is an antifungal medication used to treat infections such as athlete’s foot, thrush, and ringworm. It stops the growth of fungi by affecting their cell membrane.",
    "dosage": "Apply to the affected area 2–3 times daily for at least 2 weeks.\n\nFor vaginal infections, insert 1 pessary daily for 3–6 days depending on strength.",
    "sideEffects": "Redness, itching, burning at application site.\n\nRare: allergic reaction or blistering.",
    "importantInfo": "Complete full course even if symptoms improve.\n\nAvoid using tight clothing over treated areas.\n\nDo not use tampons or douches during vaginal treatment."
  },
  {
    "name": "Clotrimazole (Canesten)",
    "brand": "Canesten, Gyno-Canesten, Mycelex, Lotrimin, Clotrim.",
    "description": "This formulation of clotrimazole is specifically used for treating vaginal thrush and external fungal infections. It helps relieve itching, discharge, and discomfort caused by fungal overgrowth.",
    "dosage": "Cream: apply externally 2–3 times daily.\n\nPessary: 500 mg once or 100 mg daily for 6 days intravaginally.",
    "sideEffects": "Mild irritation, burning, or redness.\n\nRare: allergic reaction or swelling.",
    "importantInfo": "Use at bedtime for vaginal pessaries for best absorption.\n\nAvoid sexual intercourse during treatment.\n\nSee a doctor if symptoms persist after treatment."
  },
  {
    "name": "Co-amoxiclav",
    "brand": "Augmentin, Clavamox, Curam, Amoclan, Synulox.",
    "description": "Co-amoxiclav is a combination antibiotic of amoxicillin and clavulanic acid. It is used to treat a wide range of bacterial infections by preventing bacterial resistance to amoxicillin.",
    "dosage": "Adults: 500/125 mg every 8 hours, or 875/125 mg twice daily.\n\nChildren: dose based on weight, typically 20–40 mg/kg/day in divided doses.",
    "sideEffects": "Diarrhea, nausea, skin rash.\n\nRare: liver enzyme elevation, jaundice, allergic reactions.",
    "importantInfo": "Take with food to reduce stomach upset.\n\nComplete the full course as prescribed.\n\nInform your doctor of any penicillin allergies."
  },
  {
    "name": "Co-beneldopa",
    "brand": "Madopar, Benserazide/Levodopa, Prolopa, Doparil.",
    "description": "Co-beneldopa is used to treat Parkinson’s disease. It combines levodopa (which converts to dopamine in the brain) with benserazide to enhance its effect and reduce side effects.",
    "dosage": "Dose is individualized. Often starts with 62.5 mg 3–4 times daily, gradually increased.\n\nModified-release forms are also available.",
    "sideEffects": "Nausea, dizziness, involuntary movements (dyskinesia).\n\nMay cause confusion or vivid dreams in some patients.",
    "importantInfo": "Take at consistent times each day.\n\nAvoid high-protein meals around dosing.\n\nDo not stop suddenly — risk of serious symptoms."
  },
  {
    "name": "Co-careldopa",
    "brand": "Sinemet, Caramet, Lecado, Duodopa (intestinal gel), Sinemet Plus.",
    "description": "Co-careldopa is another formulation for Parkinson’s disease combining levodopa with carbidopa. It helps reduce motor symptoms and improves mobility.",
    "dosage": "Typical starting dose: 62.5–125 mg three times daily, titrated based on response.\n\nModified-release tablets may be used for smoother symptom control.",
    "sideEffects": "Nausea, dizziness, low blood pressure, hallucinations.\n\nLong-term use may cause involuntary movements.",
    "importantInfo": "Take consistently, preferably with a small snack.\n\nAvoid stopping abruptly — taper slowly.\n\nMay interact with antipsychotics and iron supplements."
  },
  {
    "name": "Co-codamol",
    "brand": "Kapake, Solpadeine, Tylex, Codipar, Zapain.",
    "description": "Co-codamol is a combination of paracetamol and codeine, used to treat moderate pain when standard painkillers are not effective. Codeine is an opioid that enhances the effect of paracetamol.",
    "dosage": "Standard: 8/500 mg or 30/500 mg tablets.\n\nTake 1–2 tablets every 4–6 hours as needed. Do not exceed 8 tablets per day.",
    "sideEffects": "Constipation, drowsiness, nausea, dizziness.\n\nProlonged use can lead to dependence or tolerance.",
    "importantInfo": "Do not take with other paracetamol products.\n\nAvoid alcohol and activities requiring alertness.\n\nUse for short-term pain relief unless advised otherwise."
  },
  {
    "name": "Co-codaprin (aspirin and codeine)",
    "brand": "Codis, Codaprin, Aspicode, Codaphen, Codaspirin.",
    "description": "Co-codaprin is a combination of aspirin and codeine used for short-term relief of moderate pain that is not relieved by aspirin, ibuprofen, or paracetamol alone.",
    "dosage": "Adults: 1–2 tablets every 4–6 hours as needed.\n\nMaximum: 8 tablets in 24 hours.\n\nNot recommended for children under 16 due to aspirin content.",
    "sideEffects": "Drowsiness, constipation, stomach irritation.\n\nRare: allergic reaction, gastrointestinal bleeding.",
    "importantInfo": "Do not take with other NSAIDs or paracetamol/codeine products.\n\nAvoid alcohol while using.\n\nUse the lowest dose for the shortest duration to prevent dependence."
  },
  {
    "name": "Co-dydramol",
    "brand": "Paramol, Remedeine, Cyndol, Dygramol, Codramol.",
    "description": "Co-dydramol is a painkiller combining paracetamol with dihydrocodeine. It is used for moderate pain when other pain relievers are not effective.",
    "dosage": "Typical adult dose: 1–2 tablets every 4–6 hours.\n\nDo not exceed 8 tablets in 24 hours.",
    "sideEffects": "Nausea, constipation, dizziness, drowsiness.\n\nLong-term use can lead to tolerance or dependence.",
    "importantInfo": "Avoid other products containing paracetamol.\n\nDo not use for more than a few days unless prescribed.\n\nAvoid alcohol and heavy machinery while taking."
  },
  {
    "name": "Coal tar",
    "brand": "Polytar, Exorex, Alphosyl, T/Gel, Capasal.",
    "description": "Coal tar is used to treat psoriasis, eczema, and seborrheic dermatitis. It helps reduce itching, scaling, and inflammation by slowing skin cell growth.",
    "dosage": "Apply to affected areas once or twice daily.\n\nShampoo: use 1–3 times weekly as directed.",
    "sideEffects": "Skin irritation, staining of clothes or hair, sensitivity to sunlight.\n\nUnpleasant odor is common.",
    "importantInfo": "Avoid excessive sun exposure.\n\nDo not apply to broken or infected skin.\n\nWash hands thoroughly after use."
  },
  {
    "name": "Codeine",
    "brand": "Codeine Phosphate, Codipar, Solpadeine Max, Nurofen Plus (combo), Tylex.",
    "description": "Codeine is an opioid painkiller used to treat mild to moderate pain, cough, and sometimes diarrhea. It works by blocking pain signals in the brain and spinal cord.",
    "dosage": "Pain relief: 15–60 mg every 4–6 hours as needed.\n\nMaximum: 240 mg/day.\n\nAlways start with the lowest effective dose.",
    "sideEffects": "Constipation, drowsiness, dizziness, nausea.\n\nProlonged use may cause dependence or withdrawal.",
    "importantInfo": "Avoid alcohol and other CNS depressants.\n\nDo not exceed recommended dose.\n\nNot suitable for children under 12 or for long-term use without medical supervision."
  },
  {
    "name": "Colchicine",
    "brand": "Colcrys, Mitigare, Colgout, Kolsin, Lodur.",
    "description": "Colchicine is used to treat and prevent gout attacks and familial Mediterranean fever. It works by reducing inflammation caused by uric acid crystals in joints.",
    "dosage": "Acute gout: 500 mcg 2–4 times daily until relief or max 6 mg over 3–4 days.\n\nPrevention: 500 mcg once or twice daily.",
    "sideEffects": "Nausea, vomiting, diarrhea, abdominal pain.\n\nHigh doses: bone marrow suppression, nerve or kidney damage.",
    "importantInfo": "Avoid grapefruit juice — may increase side effects.\n\nTake exactly as prescribed.\n\nNot for long-term use unless directed."
  },
  {
    "name": "Colecalciferol",
    "brand": "Fultium-D3, D-Vi-Sol, Dekristol, Calci-D, Vit-D3.",
    "description": "Colecalciferol (vitamin D3) is used to prevent and treat vitamin D deficiency, supporting calcium absorption and bone health.",
    "dosage": "Prevention: 400–1,000 IU daily.\n\nDeficiency treatment: 20,000–50,000 IU weekly for 6–8 weeks, followed by maintenance.",
    "sideEffects": "Rare at normal doses: nausea, headache, fatigue.\n\nHigh doses: hypercalcemia, kidney stones, confusion.",
    "importantInfo": "Take with food for better absorption.\n\nDo not exceed recommended dose.\n\nMonitor calcium levels during high-dose treatment."
  },
  {
    "name": "Contraceptive injections (medroxyprogesterone)",
    "brand": "Depo-Provera, Sayana Press, Provera (oral), Cyclofem, Noristerat.",
    "description": "Medroxyprogesterone injections are a form of long-acting contraception. They prevent ovulation and alter the uterine lining to prevent pregnancy.",
    "dosage": "150 mg intramuscularly every 12 weeks (Depo-Provera).\n\n104 mg subcutaneously every 13 weeks (Sayana Press).",
    "sideEffects": "Weight gain, irregular periods, delayed fertility return.\n\nLong-term use may reduce bone density.",
    "importantInfo": "Ensure timely repeat injections every 12–13 weeks.\n\nDiscuss bone health if used for more than 2 years.\n\nDoes not protect against STIs."
  },
  {
    "name": "Cyanocobalamin",
    "brand": "Cytacon, Betolvex, Nascobal, Rubramin, Cobalin-H.",
    "description": "Cyanocobalamin is a synthetic form of vitamin B12 used to treat or prevent B12 deficiency. It supports red blood cell formation and nerve function.",
    "dosage": "IM injection: 1,000 mcg weekly for 6–8 weeks, then monthly.\n\nOral: 50–2,000 mcg daily depending on deficiency severity.",
    "sideEffects": "Injection site pain, headache, nausea.\n\nRare: low potassium, allergic reaction.",
    "importantInfo": "Essential for patients with pernicious anemia or absorption issues.\n\nMonitor B12 and hemoglobin levels regularly.\n\nMay be lifelong in some individuals."
  },
  {
    "name": "Cyclizine",
    "brand": "Valoid, Marezine, Marzine, Cyclivert, Cidrine.",
    "description": "Cyclizine is an antihistamine used to prevent and treat nausea, vomiting, and vertigo, especially related to motion sickness or post-operative recovery.",
    "dosage": "Adults: 50 mg up to three times a day.\n\nChildren 6–12: 25 mg up to three times daily.",
    "sideEffects": "Drowsiness, dry mouth, blurred vision.\n\nOccasionally: headache, dizziness, or allergic reactions.",
    "importantInfo": "May impair concentration — avoid driving or alcohol.\n\nTake 30 minutes before travel for motion sickness.\n\nNot recommended for children under 6."
  },
  {
    "name": "Dabigatran",
    "brand": "Pradaxa, Pradax, Praxada, Dabigo, Dabiwin.",
    "description": "Dabigatran is an oral anticoagulant used to prevent stroke in atrial fibrillation and to treat or prevent deep vein thrombosis and pulmonary embolism.",
    "dosage": "150 mg twice daily for most adults.\n\nLower dose (110 mg) may be used in elderly or those with renal impairment.",
    "sideEffects": "Bleeding, indigestion, abdominal pain.\n\nRare: allergic reactions, liver issues.",
    "importantInfo": "Do not miss doses — clot risk increases.\n\nAvoid NSAIDs unless advised.\n\nNo routine blood monitoring, but kidney function should be checked periodically."
  },
  {
    "name": "Dapagliflozin",
    "brand": "Forxiga, Farxiga, Edistride, Dapavel, Depligo.",
    "description": "Dapagliflozin is used to treat type 2 diabetes, heart failure, and chronic kidney disease. It helps lower blood sugar and improve cardiovascular and renal outcomes.",
    "dosage": "10 mg once daily, with or without food.\n\nMay be used alone or in combination with other diabetes medications.",
    "sideEffects": "Urinary tract infections, genital infections, increased urination.\n\nRare: dehydration, ketoacidosis, Fournier’s gangrene.",
    "importantInfo": "Stay well hydrated.\n\nMonitor for signs of infection or ketoacidosis (e.g. abdominal pain, vomiting).\n\nNot for use in type 1 diabetes or severe kidney disease."
  },
  {
    "name": "Dexamethasone",
    "brand": "DexPak, Decadron, Ozurdex, Maxidex, Dextenza.",
    "description": "Dexamethasone is a corticosteroid used to reduce inflammation in a wide range of conditions including asthma, severe allergies, arthritis, and COVID-19 treatment.",
    "dosage": "Dose depends on condition: 0.5–10 mg daily orally or via injection.\n\nShort courses are common for acute inflammation.",
    "sideEffects": "Increased appetite, mood changes, insomnia.\n\nLong-term: weight gain, osteoporosis, high blood sugar.",
    "importantInfo": "Take with food to reduce stomach upset.\n\nDo not stop suddenly after long-term use — taper gradually.\n\nMonitor for infection or unusual mood changes."
  },
  {
    "name": "Diazepam",
    "brand": "Valium, Stesolid, Ducene, Antenex, Calmpose.",
    "description": "Diazepam is a benzodiazepine used to treat anxiety, muscle spasms, seizures, and alcohol withdrawal. It works by calming the brain and nerves.",
    "dosage": "Anxiety: 2–10 mg up to 3–4 times daily.\n\nMuscle spasm or alcohol withdrawal: similar dosing as needed.\n\nSeizures: rectal gel or IV/IM in acute settings.",
    "sideEffects": "Drowsiness, fatigue, dizziness, blurred vision.\n\nLong-term use: tolerance, dependence, memory issues.",
    "importantInfo": "Use short term unless advised otherwise.\n\nAvoid alcohol and do not drive while taking.\n\nTaper slowly to avoid withdrawal."
  },
  {
    "name": "Diclofenac",
    "brand": "Voltarol, Cataflam, Diclac, Fenactol, Olfen.",
    "description": "Diclofenac is a nonsteroidal anti-inflammatory drug (NSAID) used to relieve pain and inflammation in conditions such as arthritis, sprains, and menstrual cramps.",
    "dosage": "Typical dose: 50 mg two or three times daily.\n\nMaximum: 150 mg per day.\n\nTopical gels available for local relief.",
    "sideEffects": "Indigestion, stomach pain, headache.\n\nSerious: ulcers, bleeding, cardiovascular risk.",
    "importantInfo": "Take with food to reduce stomach upset.\n\nAvoid other NSAIDs while using.\n\nNot recommended for people with heart disease or GI history."
  },
  {
    "name": "Digoxin",
    "brand": "Lanoxin, Cardoxin, Digitek, Toloxin, Noxin.",
    "description": "Digoxin is used to treat heart failure and atrial fibrillation. It increases the force of heart contractions and slows the heart rate.",
    "dosage": "Typical maintenance: 125–250 mcg once daily.\n\nDose adjusted based on kidney function and blood levels.",
    "sideEffects": "Nausea, dizziness, blurred vision, confusion.\n\nToxicity: irregular heartbeat, vomiting, vision changes.",
    "importantInfo": "Monitor blood levels regularly.\n\nAvoid taking with high-fiber meals or antacids close to dosing.\n\nWatch for signs of toxicity — seek help if suspected."
  },
  {
    "name": "Dihydrocodeine",
    "brand": "DF118 Forte, DHC Continus, Co-dydramol (combo), Paracodol, Synap Forte.",
    "description": "Dihydrocodeine is an opioid painkiller used for moderate to severe pain. It works similarly to codeine but may be more effective in some cases.",
    "dosage": "Standard dose: 30 mg every 4–6 hours.\n\nModified release: 60–120 mg every 12 hours.",
    "sideEffects": "Drowsiness, constipation, nausea, dry mouth.\n\nProlonged use: dependence, tolerance, withdrawal symptoms.",
    "importantInfo": "Avoid alcohol and driving.\n\nUse the lowest effective dose for the shortest duration.\n\nNot recommended for long-term use unless supervised."
  },
  {
    "name": "Diltiazem",
    "brand": "Tildiem, Adizem, Dilzem, Cardizem, Angitil.",
    "description": "Diltiazem is a calcium channel blocker used to treat high blood pressure, angina, and some heart rhythm disorders. It relaxes blood vessels and reduces heart rate.",
    "dosage": "Typical oral dose: 120–360 mg daily, in divided or extended-release form.\n\nDose adjusted based on response and condition treated.",
    "sideEffects": "Dizziness, headache, flushing, slow heart rate.\n\nLess common: swollen ankles, fatigue, rash.",
    "importantInfo": "Do not crush extended-release tablets.\n\nAvoid grapefruit juice — may increase blood levels.\n\nMonitor heart rate and blood pressure regularly."
  },
  {
    "name": "Diphenhydramine",
    "brand": "Nytol, Benadryl, Sominex, Sleepinal, Diphenhist.",
    "description": "Diphenhydramine is a sedating antihistamine used for allergies, cold symptoms, and short-term treatment of insomnia. It also relieves motion sickness and nausea.",
    "dosage": "Allergy or sleep aid: 25–50 mg at bedtime.\n\nMotion sickness: 25–50 mg every 6–8 hours as needed.",
    "sideEffects": "Drowsiness, dry mouth, dizziness, blurred vision.\n\nCan impair thinking and coordination.",
    "importantInfo": "Do not mix with alcohol or other sedatives.\n\nNot recommended for long-term sleep use.\n\nAvoid in children under 6 unless advised."
  },
  {
    "name": "Dipyridamole",
    "brand": "Persantin, Dipyridamole Mylan, Asasantin (with aspirin), Dipyridamole Accord.",
    "description": "Dipyridamole is an antiplatelet and vasodilator used to prevent stroke, often in combination with aspirin. It also improves blood flow during cardiac stress testing.",
    "dosage": "Stroke prevention: 200 mg modified-release twice daily with aspirin.\n\nCardiac testing: IV infusion in hospital setting.",
    "sideEffects": "Headache, dizziness, stomach upset, flushing.\n\nRare: low blood pressure, bleeding.",
    "importantInfo": "Take modified-release capsules whole.\n\nAvoid caffeine before stress testing.\n\nMonitor for signs of bleeding if combined with other anticoagulants."
  },
  {
    "name": "Docusate",
    "brand": "Colace, Dioctyl, DulcoEase, Soflax, Surfak.",
    "description": "Docusate is a stool softener used to relieve occasional constipation. It works by increasing water absorption into the stool, making it easier to pass.",
    "dosage": "Adults: 100–200 mg once or twice daily.\n\nChildren: dosage depends on age — follow packaging or doctor’s advice.",
    "sideEffects": "Stomach cramps, diarrhea, bitter taste.\n\nRare: throat irritation (liquid form).",
    "importantInfo": "Stay well hydrated during use.\n\nNot for long-term use unless prescribed.\n\nDiscontinue if diarrhea or cramping occurs."
  },
  {
    "name": "Domperidone",
    "brand": "Motilium, Domstal, Domperon, Vomistop, Costi.",
    "description": "Domperidone is a medication used to relieve nausea, vomiting, bloating, and stomach discomfort by increasing the movement of the stomach and intestines.",
    "dosage": "10 mg up to three times daily, 15–30 minutes before meals.\n\nDo not exceed 30 mg in 24 hours without medical advice.",
    "sideEffects": "Dry mouth, abdominal cramps, dizziness.\n\nRare: irregular heartbeat or QT prolongation.",
    "importantInfo": "Do not use long term unless advised.\n\nAvoid if you have heart rhythm disorders.\n\nReport chest pain or fainting immediately."
  },
  {
    "name": "Donepezil",
    "brand": "Aricept, Donetaz, Donecept, Donetec, Alzepil.",
    "description": "Donepezil is used to treat symptoms of Alzheimer's disease. It works by increasing levels of acetylcholine in the brain to improve memory and cognitive function.",
    "dosage": "Start with 5 mg once daily at bedtime.\n\nMay increase to 10 mg daily after 4–6 weeks if tolerated.",
    "sideEffects": "Nausea, diarrhea, insomnia, muscle cramps.\n\nSerious: fainting, slow heart rate, seizures.",
    "importantInfo": "Take at bedtime to reduce nausea.\n\nMay take a few weeks for effects to be noticeable.\n\nContinue even if no immediate improvement is seen."
  },
  {
    "name": "Dosulepin",
    "brand": "Prothiaden, Dothiepin, Dothep, Thaden, Dosulin.",
    "description": "Dosulepin is a tricyclic antidepressant used to treat depression and anxiety. It works by increasing the levels of serotonin and norepinephrine in the brain.",
    "dosage": "Typical dose: 75–150 mg daily in divided doses or once at bedtime.\n\nStart low and increase gradually under supervision.",
    "sideEffects": "Drowsiness, dry mouth, constipation, blurred vision.\n\nOverdose can be fatal — use with caution.",
    "importantInfo": "Not a first-line antidepressant — reserved for cases not responding to others.\n\nAvoid alcohol and driving.\n\nDo not stop suddenly without medical advice."
  },
  {
    "name": "Doxazosin",
    "brand": "Cardura, Doxadura, Raporsin, Doxapress, Duracin.",
    "description": "Doxazosin is an alpha-blocker used to treat high blood pressure and symptoms of an enlarged prostate (BPH). It relaxes blood vessels and urinary tract muscles.",
    "dosage": "Initial dose: 1 mg once daily.\n\nMaintenance: 2–8 mg daily depending on response.",
    "sideEffects": "Dizziness, fatigue, headache, low blood pressure.\n\nFirst dose may cause fainting — known as 'first-dose effect'.",
    "importantInfo": "Take at bedtime to reduce dizziness.\n\nStand up slowly to avoid lightheadedness.\n\nMonitor blood pressure regularly."
  },
  {
    "name": "Doxycycline",
    "brand": "Vibramycin, Doryx, Monodox, Periostat, Doxytab.",
    "description": "Doxycycline is a tetracycline antibiotic used to treat a variety of infections, including respiratory tract infections, acne, and sexually transmitted diseases.",
    "dosage": "Typical dose: 100 mg once or twice daily.\n\nInitial dose may be 200 mg followed by maintenance dosing.",
    "sideEffects": "Nausea, sun sensitivity, upset stomach.\n\nRare: esophageal irritation, tooth discoloration (children).",
    "importantInfo": "Take with plenty of water and remain upright for 30 minutes.\n\nAvoid milk, antacids, or supplements containing calcium or iron close to dosing.\n\nNot recommended during pregnancy or for children under 8."
  },
  {
    "name": "Duloxetine",
    "brand": "Cymbalta, Yentreve, Ariclaim, Duzela, Dulane.",
    "description": "Duloxetine is a serotonin-norepinephrine reuptake inhibitor (SNRI) used to treat depression, anxiety, nerve pain, and fibromyalgia.",
    "dosage": "Typical dose: 30–60 mg once daily.\n\nMaximum: 120 mg per day for some conditions.",
    "sideEffects": "Nausea, dry mouth, fatigue, increased sweating.\n\nMay raise blood pressure or cause withdrawal symptoms if stopped abruptly.",
    "importantInfo": "Do not stop suddenly — taper gradually under medical guidance.\n\nMonitor for mood changes or suicidal thoughts, especially early in treatment.\n\nMay take a few weeks for full effects."
  },
  {
    "name": "Edoxaban",
    "brand": "Lixiana, Savaysa, Edoxa, Roteas.",
    "description": "Edoxaban is a direct oral anticoagulant (DOAC) used to prevent stroke in atrial fibrillation and treat or prevent deep vein thrombosis (DVT) and pulmonary embolism (PE).",
    "dosage": "Typical dose: 60 mg once daily.\n\nReduced to 30 mg daily in patients with renal impairment or low body weight.",
    "sideEffects": "Bleeding, bruising, anemia.\n\nRare: liver enzyme changes or allergic reactions.",
    "importantInfo": "Do not miss doses or stop without consulting your doctor.\n\nAvoid NSAIDs or aspirin unless prescribed.\n\nNo routine blood monitoring required, but kidney function should be checked."
  },
  {
    "name": "Empagliflozin",
    "brand": "Jardiance, Glyxambi (combo), Synjardy (combo), Empa, Jardiva.",
    "description": "Empagliflozin is an SGLT2 inhibitor used to treat type 2 diabetes, heart failure, and chronic kidney disease. It helps reduce blood sugar by promoting glucose excretion in urine.",
    "dosage": "Starting dose: 10 mg once daily.\n\nMay be increased to 25 mg once daily if needed.",
    "sideEffects": "Urinary tract infections, genital infections, increased urination.\n\nRare: dehydration, ketoacidosis, Fournier’s gangrene.",
    "importantInfo": "Drink plenty of fluids.\n\nMonitor for unusual symptoms like abdominal pain or weakness.\n\nNot suitable for type 1 diabetes or during active infections."
  },
  {
    "name": "Enalapril",
    "brand": "Innovace, Renitec, Vasotec, Envas, Napril.",
    "description": "Enalapril is an ACE inhibitor used to treat high blood pressure, heart failure, and kidney problems in people with diabetes. It helps relax blood vessels.",
    "dosage": "Hypertension: 5–20 mg once or twice daily.\n\nHeart failure: start with 2.5 mg and titrate based on tolerance and kidney function.",
    "sideEffects": "Dry cough, dizziness, headache.\n\nRare: high potassium, kidney dysfunction, angioedema.",
    "importantInfo": "Monitor kidney function and potassium.\n\nAvoid potassium supplements unless advised.\n\nInform your doctor if you experience swelling of the face or lips."
  },
  {
    "name": "Eplerenone",
    "brand": "Inspra, Epleridone, Selipran, Eplar, Eplecard.",
    "description": "Eplerenone is a potassium-sparing diuretic used to treat heart failure and high blood pressure. It works by blocking aldosterone receptors.",
    "dosage": "Heart failure: 25 mg once daily, may increase to 50 mg.\n\nHypertension: 50 mg once daily, max 100 mg/day.",
    "sideEffects": "High potassium, dizziness, diarrhea.\n\nRare: breast tenderness or enlargement, especially in men.",
    "importantInfo": "Monitor potassium and kidney function regularly.\n\nAvoid potassium-rich foods or supplements.\n\nUse caution with other medications that raise potassium."
  },
  {
    "name": "Erythromycin",
    "brand": "Erythrocin, Erymax, Erythroped, Ilosone, Erybid.",
    "description": "Erythromycin is a macrolide antibiotic used to treat chest infections, skin infections, and STIs. It’s often used when patients are allergic to penicillin.",
    "dosage": "Typical adult dose: 250–500 mg every 6 hours.\n\nChildren’s dosing is weight-based and varies by infection.",
    "sideEffects": "Nausea, abdominal pain, diarrhea.\n\nCan cause liver issues or QT prolongation in rare cases.",
    "importantInfo": "Take with or just after food.\n\nAvoid with certain heart or seizure medications — check with your doctor.\n\nFinish the course even if you feel better."
  },
  {
    "name": "Escitalopram",
    "brand": "Cipralex, Lexapro, Esram, Esopral, Es-Citalopram.",
    "description": "Escitalopram is an SSRI antidepressant used to treat depression and generalized anxiety disorder. It increases serotonin levels in the brain.",
    "dosage": "Starting dose: 10 mg once daily.\n\nMay be increased to 20 mg daily depending on response.",
    "sideEffects": "Nausea, headache, insomnia, sexual dysfunction.\n\nMay initially increase anxiety or agitation.",
    "importantInfo": "May take several weeks to take full effect.\n\nAvoid stopping suddenly — taper under medical supervision.\n\nMonitor for mood changes, especially in the first few weeks."
  },
  {
    "name": "Esomeprazole",
    "brand": "Nexium, Esomac, Esoz, Esotrex, Nexotac.",
    "description": "Esomeprazole is a proton pump inhibitor (PPI) used to treat acid reflux, heartburn, ulcers, and conditions involving excessive stomach acid.",
    "dosage": "Typical dose: 20–40 mg once daily.\n\nSome cases (e.g. ulcers or H. pylori treatment) may require twice-daily dosing temporarily.",
    "sideEffects": "Headache, abdominal pain, constipation, dry mouth.\n\nLong-term: risk of low magnesium, B12 deficiency, fractures.",
    "importantInfo": "Take at least 30 minutes before meals.\n\nDo not crush or chew tablets.\n\nUse the lowest effective dose for the shortest duration."
  },
  {
    "name": "Ezetimibe",
    "brand": "Ezetrol, Ezedoc, Ezerex, Liponorm-EZ, Zetia.",
    "description": "Ezetimibe is a cholesterol-lowering medication that reduces absorption of cholesterol from the small intestine. It is often used with statins.",
    "dosage": "10 mg once daily, with or without food.\n\nCan be used alone or in combination with a statin.",
    "sideEffects": "Muscle pain, fatigue, diarrhea.\n\nRare: liver enzyme elevation, allergic reactions.",
    "importantInfo": "Liver function should be monitored if used with statins.\n\nReport unexplained muscle pain or weakness.\n\nMaintain a cholesterol-lowering diet alongside medication."
  },
  {
    "name": "Felodipine",
    "brand": "Plendil, Felodur, Vascalpha, Felogard, Neofel.",
    "description": "Felodipine is a calcium channel blocker used to treat high blood pressure and angina. It relaxes blood vessels and improves blood flow.",
    "dosage": "Initial dose: 5 mg once daily.\n\nMay be adjusted between 2.5–10 mg depending on response.",
    "sideEffects": "Flushing, headache, swollen ankles, dizziness.\n\nLess common: fatigue or palpitations.",
    "importantInfo": "Take at the same time daily, preferably in the morning.\n\nAvoid grapefruit juice — it increases drug levels.\n\nDo not crush or chew extended-release tablets."
  },
  {
    "name": "Fentanyl",
    "brand": "Durogesic, Actiq, Abstral, Fencino, Instanyl.",
    "description": "Fentanyl is a powerful opioid used to treat severe pain, especially in cancer patients. It is available as patches, lozenges, and injections.",
    "dosage": "Transdermal patch: 12–100 mcg/hour changed every 72 hours.\n\nDose depends on previous opioid use and pain severity.",
    "sideEffects": "Drowsiness, constipation, nausea, respiratory depression.\n\nHigh risk of overdose or dependence.",
    "importantInfo": "Use exactly as prescribed — overdose can be fatal.\n\nAvoid heat sources near patches.\n\nStore securely and dispose of used patches safely."
  },
  {
    "name": "Ferrous fumarate",
    "brand": "Fersaday, Galfer FA, Ferrograd F, Ferrous-F, Haem Feron.",
    "description": "Ferrous fumarate is an iron supplement used to treat and prevent iron-deficiency anemia. It helps replenish iron stores needed for red blood cell production.",
    "dosage": "Typical adult dose: 200–210 mg once or twice daily.\n\nTake 30–60 minutes before meals for best absorption.",
    "sideEffects": "Constipation, dark stools, nausea, abdominal discomfort.\n\nRare: allergic reactions.",
    "importantInfo": "Take with vitamin C or orange juice to improve absorption.\n\nAvoid taking with tea, milk, or antacids.\n\nKeep out of reach of children — iron overdose can be fatal."
  },
  {
    "name": "Ferrous sulfate",
    "brand": "Feospan, Ironorm, Fero-Grad, Ferrograd, Galfer.",
    "description": "Ferrous sulfate is a common iron supplement used to treat iron-deficiency anemia. It increases the levels of iron in the blood to support oxygen transport.",
    "dosage": "Usual dose: 200 mg one to three times daily.\n\nOften taken for at least 3 months to replenish iron stores.",
    "sideEffects": "Stomach upset, constipation, dark stools.\n\nRare: metallic taste, allergic reaction.",
    "importantInfo": "Take on an empty stomach for better absorption.\n\nDo not take with tea, dairy, or calcium supplements.\n\nSwallow whole tablets — do not crush or chew."
  },
  {
    "name": "Fexofenadine",
    "brand": "Telfast, Allegra, Fexodane, Fexo, Allerfexo.",
    "description": "Fexofenadine is a non-drowsy antihistamine used to treat allergies such as hay fever, urticaria, and seasonal rhinitis.",
    "dosage": "Adults: 120–180 mg once daily.\n\nChildren’s dose varies by age — typically 30–60 mg once or twice daily.",
    "sideEffects": "Headache, nausea, drowsiness (rare), dizziness.\n\nOccasionally: dry mouth or indigestion.",
    "importantInfo": "Avoid grapefruit juice — may reduce absorption.\n\nTake with water on an empty stomach if possible.\n\nDo not exceed the recommended dose."
  },
  {
    "name": "Finasteride",
    "brand": "Proscar, Propecia, Finara, Finax, Fincar.",
    "description": "Finasteride is used to treat enlarged prostate (BPH) and male-pattern hair loss by inhibiting the conversion of testosterone to DHT.",
    "dosage": "BPH: 5 mg once daily.\n\nHair loss: 1 mg once daily.",
    "sideEffects": "Decreased libido, erectile dysfunction, breast tenderness.\n\nRare: depression, allergic reaction, breast lumps.",
    "importantInfo": "Not for use by women or children.\n\nPregnant women should not handle crushed tablets.\n\nMay take 3–6 months for noticeable effect."
  },
  {
    "name": "Flucloxacillin",
    "brand": "Floxapen, Staphylex, Flopen, Flox, Heracillin.",
    "description": "Flucloxacillin is a penicillin-type antibiotic used to treat bacterial infections such as skin infections, bone infections, and infected wounds.",
    "dosage": "Typical adult dose: 250–500 mg four times daily.\n\nBest taken on an empty stomach, 1 hour before or 2 hours after meals.",
    "sideEffects": "Nausea, diarrhea, skin rash.\n\nRare: liver enzyme changes, allergic reactions.",
    "importantInfo": "Complete the full course even if symptoms improve.\n\nInform your doctor if allergic to penicillin.\n\nTake doses evenly spaced throughout the day."
  },
  {
    "name": "Fluconazole",
    "brand": "Diflucan, Canesten Oral, Flucoral, Flucan, Zocon.",
    "description": "Fluconazole is an antifungal medication used to treat yeast infections, thrush, and systemic fungal infections. It works by stopping fungal growth.",
    "dosage": "Common dose for thrush: 150 mg single dose.\n\nOther infections: 50–400 mg once daily, depending on severity.",
    "sideEffects": "Headache, nausea, stomach pain, rash.\n\nRare: liver issues, allergic reactions, QT prolongation.",
    "importantInfo": "Avoid alcohol while taking this medication.\n\nMay interact with other drugs — inform your doctor of all medications.\n\nTake at the same time each day if using longer term."
  },
  {
    "name": "Fluoxetine (Prozac)",
    "brand": "Prozac, Oxactin, Fluctin, Lovan, Fontex.",
    "description": "Fluoxetine is an SSRI antidepressant used to treat depression, OCD, bulimia nervosa, and panic disorder by increasing serotonin levels in the brain.",
    "dosage": "Starting dose: 20 mg once daily.\n\nMay be increased to a maximum of 60 mg/day depending on condition.",
    "sideEffects": "Nausea, insomnia, headache, anxiety, sexual dysfunction.\n\nMay increase suicidal thoughts in young adults.",
    "importantInfo": "May take 2–4 weeks for full effect.\n\nAvoid abrupt discontinuation — taper if stopping.\n\nMonitor mood, especially early in treatment."
  },
  {
    "name": "Fluticasone",
    "brand": "Flixotide, Flonase, Avamys, Cutivate, Seretide (combo).",
    "description": "Fluticasone is a corticosteroid used to treat asthma, allergic rhinitis, and skin conditions. It reduces inflammation and swelling in affected areas.",
    "dosage": "Inhaler: 100–500 mcg twice daily based on severity.\n\nNasal spray: 1–2 sprays per nostril daily.\n\nTopical: apply thinly 1–2 times daily as prescribed.",
    "sideEffects": "Hoarseness, throat irritation, oral thrush.\n\nTopical use may cause skin thinning if overused.",
    "importantInfo": "Rinse mouth after inhaler use to prevent thrush.\n\nDo not use nasal spray for more than 6 weeks without review.\n\nApply skin creams sparingly and avoid eyes."
  },
  {
    "name": "Folic acid",
    "brand": "Folvite, Avfol, Fefolvit, Folacin, Ferofol.",
    "description": "Folic acid is a form of vitamin B9 used to treat or prevent folate deficiency anemia and to support pregnancy and fetal development.",
    "dosage": "Deficiency: 5 mg once daily.\n\nPregnancy: 400–800 mcg daily, starting before conception and through the first trimester.",
    "sideEffects": "Generally well tolerated.\n\nRare: rash, stomach upset, allergic reaction.",
    "importantInfo": "Essential in pregnancy to prevent neural tube defects.\n\nMay be combined with iron supplements.\n\nTake consistently for full benefit."
  },
  {
    "name": "Furosemide",
    "brand": "Lasix, Frusemide, Frumex, Fusid, Diurin.",
    "description": "Furosemide is a loop diuretic used to treat fluid retention (edema) and high blood pressure. It works by helping the kidneys remove excess fluid.",
    "dosage": "Edema: 20–80 mg once or twice daily.\n\nHypertension: lower doses, often combined with other drugs.",
    "sideEffects": "Frequent urination, dizziness, low potassium, dehydration.\n\nRare: gout, hearing loss with high doses.",
    "importantInfo": "Take in the morning to avoid nighttime urination.\n\nMonitor electrolytes and kidney function.\n\nStay well hydrated unless otherwise advised."
  },
  {
    "name": "Fusidic acid",
    "brand": "Fucidin, Fucibet (combo), Fusigen, Stafine, Fucithalmic (eye).",
    "description": "Fusidic acid is an antibiotic used topically or in eye drops to treat skin infections such as impetigo and infected dermatitis.",
    "dosage": "Apply thinly to affected area 2–3 times daily.\n\nEye drops: 1 drop twice daily for up to 7 days.",
    "sideEffects": "Skin irritation, stinging, mild rash.\n\nRare: allergic reaction or resistance with long-term use.",
    "importantInfo": "Do not use for longer than 1–2 weeks without medical advice.\n\nAvoid contact with eyes unless using eye-specific formulation.\n\nWash hands after application."
  },
  {
    "name": "Fybogel (ispaghula husk)",
    "brand": "Fybogel, Ispagel, Regulan, Isogel, Effersyllium.",
    "description": "Fybogel is a bulk-forming laxative used to treat constipation and maintain regular bowel movements. It contains ispaghula husk, a natural source of fiber.",
    "dosage": "Adults: 1 sachet in water twice daily after meals.\n\nChildren: half dosage, based on age and response.",
    "sideEffects": "Bloating, flatulence, stomach cramps.\n\nRare: allergic reactions or blockage if not taken with enough water.",
    "importantInfo": "Always take with a full glass of water.\n\nDo not take before bedtime.\n\nAllow 12–24 hours for effect, may take up to 3 days."
  },
  {
    "name": "Gabapentin",
    "brand": "Neurontin, Gabarone, Gralise, Gabix, Gabatrex.",
    "description": "Gabapentin is used to treat nerve pain, epilepsy, and sometimes anxiety. It works by affecting nerve signals in the brain.",
    "dosage": "Initial dose: 300 mg once daily, increased gradually up to 1,800–3,600 mg daily in divided doses.\n\nTitrate based on response and tolerance.",
    "sideEffects": "Drowsiness, dizziness, fatigue, swelling in hands/feet.\n\nMay affect coordination or mood.",
    "importantInfo": "Do not stop abruptly — risk of seizures.\n\nTake at the same times daily.\n\nAvoid alcohol and driving until you know how it affects you."
  },
  {
    "name": "Gaviscon (alginic acid)",
    "brand": "Gaviscon, Algicon, Gavilast, Acidex, Peptac.",
    "description": "Gaviscon contains alginic acid and antacids to relieve heartburn, indigestion, and acid reflux by forming a protective barrier over stomach contents.",
    "dosage": "10–20 ml (2–4 teaspoons) after meals and at bedtime.\n\nChewable tablets: 2–4 tablets after meals and at bedtime.",
    "sideEffects": "Rare: bloating, nausea, taste changes.\n\nGenerally well tolerated.",
    "importantInfo": "Do not take with large amounts of water immediately after dosing.\n\nSafe for use in pregnancy.\n\nAvoid taking other medications within 2 hours of use."
  },
  {
    "name": "Gliclazide",
    "brand": "Diamicron, Reclazide, Zicron, Glyade, Diaprel.",
    "description": "Gliclazide is a sulfonylurea used to treat type 2 diabetes. It helps the pancreas release more insulin to lower blood sugar levels.",
    "dosage": "Modified-release: 30–120 mg once daily with breakfast.\n\nImmediate-release: 40–160 mg once or twice daily.",
    "sideEffects": "Low blood sugar, weight gain, nausea.\n\nRare: liver enzyme changes, allergic reactions.",
    "importantInfo": "Take with food to avoid low blood sugar.\n\nMonitor blood glucose regularly.\n\nDo not skip meals while using this medication."
  },
  {
    "name": "Glimepiride",
    "brand": "Amaryl, Glimy, Glimulin, Glypride, Diapride.",
    "description": "Glimepiride is a sulfonylurea used for managing type 2 diabetes by stimulating insulin release from the pancreas.",
    "dosage": "Start with 1 mg daily before breakfast.\n\nMaintenance: 1–4 mg daily; max 6 mg/day depending on response.",
    "sideEffects": "Low blood sugar, weight gain, nausea.\n\nRare: rash, liver function changes.",
    "importantInfo": "Take with food to prevent hypoglycemia.\n\nAvoid alcohol — can affect blood sugar control.\n\nMonitor blood sugar regularly and carry sugar if prone to lows."
  },
  {
    "name": "Glyceryl trinitrate (GTN)",
    "brand": "Nitrolingual, Nitrostat, Rectogesic, Nitro-Dur, Transiderm-Nitro.",
    "description": "GTN is used to relieve chest pain (angina) and manage anal fissures. It works by widening blood vessels to improve blood flow and reduce heart strain.",
    "dosage": "Sublingual spray/tablet: 300–600 mcg under tongue as needed for chest pain.\n\nRectal ointment: apply small amount twice daily for anal fissures.",
    "sideEffects": "Headache, dizziness, flushing.\n\nMay cause low blood pressure or fainting.",
    "importantInfo": "Sit down before using for angina to avoid dizziness.\n\nDo not use with erectile dysfunction drugs — risk of serious drop in blood pressure.\n\nStore spray in original container away from heat."
  },
  {
    "name": "Haloperidol",
    "brand": "Haldol, Serenace, Halol, Dozic, Einalon.",
    "description": "Haloperidol is an antipsychotic used to treat schizophrenia, severe agitation, psychosis, and sometimes Tourette’s syndrome or acute nausea.",
    "dosage": "Oral: 1–15 mg daily in divided doses.\n\nIntramuscular for acute agitation: 2–10 mg as needed.",
    "sideEffects": "Drowsiness, restlessness, tremors, dry mouth.\n\nSerious: movement disorders (e.g., tardive dyskinesia), QT prolongation.",
    "importantInfo": "Regularly monitor for side effects during long-term use.\n\nAvoid alcohol and driving.\n\nNot typically first-line for elderly patients with dementia."
  },
  {
    "name": "Heparinoid",
    "brand": "Hirudoid, Thrombophob, Mobilat, Hepathrombin, Venosan.",
    "description": "Heparinoid creams and gels are used to treat bruises, sprains, and superficial thrombophlebitis. They help reduce inflammation and improve blood flow in the affected area.",
    "dosage": "Apply 2–3 times daily to the affected area.\n\nMassage in gently unless otherwise instructed.",
    "sideEffects": "Skin irritation, redness, itching.\n\nRare: allergic reaction.",
    "importantInfo": "Do not apply to broken or infected skin.\n\nAvoid contact with eyes or mucous membranes.\n\nWash hands after use."
  },
  {
    "name": "Hormone replacement therapy (HRT)",
    "brand": "Evorel, Femoston, Premarin, Elleste, Kliovance.",
    "description": "HRT is used to relieve menopausal symptoms by replacing declining hormone levels (estrogen and sometimes progesterone). It can be oral, transdermal, or vaginal.",
    "dosage": "Depends on formulation — typically daily pills, patches changed twice weekly, or gels applied daily.",
    "sideEffects": "Breast tenderness, mood changes, headache, bloating.\n\nIncreased risk of blood clots and certain cancers with prolonged use.",
    "importantInfo": "Review treatment annually with a doctor.\n\nReport unusual vaginal bleeding, breast lumps, or persistent pain.\n\nUse lowest effective dose for the shortest duration."
  },
  {
    "name": "Hydrocortisone",
    "brand": "Cortef, Hydrocort, Locoid, Deltacortil, Dermacort.",
    "description": "Hydrocortisone is a corticosteroid used for inflammation, allergic reactions, and adrenal insufficiency. Available as tablets, creams, injections, and suppositories.",
    "dosage": "Topical: apply thinly 1–2 times daily.\n\nOral: 10–30 mg/day for adrenal insufficiency (divided doses).\n\nDose depends on condition and formulation.",
    "sideEffects": "Skin thinning (topical), increased appetite, mood changes, insomnia.\n\nLong-term use: osteoporosis, adrenal suppression.",
    "importantInfo": "Do not stop oral treatment suddenly — taper gradually.\n\nApply topical forms sparingly and avoid eyes.\n\nMonitor for infection or weight gain if using long term."
  },
  {
    "name": "Hydroxocobalamin",
    "brand": "Cyanokit, Neo-Cytamen, Hydroxine, Vitarubin, Cobalamin.",
    "description": "Hydroxocobalamin is a long-acting form of vitamin B12 used to treat and prevent B12 deficiency, especially in pernicious anemia.",
    "dosage": "1,000 mcg intramuscularly every 2–3 months (maintenance).\n\nInitial treatment: multiple doses over the first few weeks.",
    "sideEffects": "Injection site pain, redness, mild diarrhea.\n\nRare: allergic reaction, low potassium.",
    "importantInfo": "Essential for nerve and blood cell health.\n\nSafe for use in pregnancy.\n\nMonitor B12 and hemoglobin levels during treatment."
  },
  {
    "name": "Hydroxychloroquine",
    "brand": "Plaquenil, Quinoric, Axemal, Zentiva HCQ, Dolquine.",
    "description": "Hydroxychloroquine is used to treat autoimmune diseases like lupus and rheumatoid arthritis, and as a malaria prophylactic. It modifies immune response and inflammation.",
    "dosage": "RA/Lupus: 200–400 mg once daily or divided doses.\n\nMalaria prevention: 400 mg once weekly.",
    "sideEffects": "Nausea, headache, visual disturbances.\n\nLong-term: retinal damage, muscle weakness.",
    "importantInfo": "Requires regular eye exams during prolonged use.\n\nTake with food to reduce stomach upset.\n\nReport visual changes promptly."
  },
  {
    "name": "Hyoscine hydrobromide (Kwells and Joy-Rides)",
    "brand": "Kwells, Joy-Rides, Scopoderm, Buscopan, Travacalm.",
    "description": "Hyoscine hydrobromide is used to prevent motion sickness and treat nausea. It works by blocking signals from the inner ear to the vomiting center in the brain.",
    "dosage": "Adults: 300–600 mcg every 6–8 hours.\n\nChildren: 150–300 mcg depending on age and formulation.",
    "sideEffects": "Dry mouth, blurred vision, drowsiness, constipation.\n\nRare: confusion, especially in older adults.",
    "importantInfo": "May cause drowsiness — avoid driving.\n\nTake 30–60 minutes before travel for best effect.\n\nAvoid alcohol and use with caution in glaucoma or urinary retention."
  },
  {
    "name": "Ibuprofen",
    "brand": "Brufen, Calprofen, Fenbid, Ibugel, Ibuleve.",
    "description": "Ibuprofen is an everyday painkiller for a range of aches and pains, including back pain, period pain, toothache and symptoms of colds, flu or coronavirus (COVID-19). It also treats inflammation such as sprains and strains, and pain from arthritis.",
    "dosage": "For adults, the typical dosage is 200–400 mg taken every 4 to 6 hours as needed.\n\nFor children, the dosage depends on age and weight. Typically, 5–10 mg per kg of body weight every 6 to 8 hours is recommended, not to exceed 40 mg/kg per day.\n\nPatients are advised to start with the lowest effective dose and adjust based on the severity of symptoms.",
    "sideEffects": "Common side effects may include: nausea, dizziness, headache, and stomach upset.\n\nMore rarely: gastrointestinal bleeding, ulcers, kidney issues, or allergic reactions.",
    "importantInfo": "Take with food or milk to reduce stomach irritation.\n\nAvoid using with other NSAIDs.\n\nLong-term use may increase risks of heart, kidney, or stomach issues. Consult your doctor before making any changes, especially if you have health conditions or take other meds."
  },
  {
    "name": "Indapamide",
    "brand": "Natrilix, Lozol, Inda, Dapa, Fludex.",
    "description": "Indapamide is a thiazide-like diuretic used to treat high blood pressure and fluid retention by helping the kidneys remove excess sodium and water.",
    "dosage": "Hypertension: 1.5 mg modified-release once daily.\n\nEdema: 2.5 mg once daily, adjusted as needed.",
    "sideEffects": "Dizziness, low potassium, dehydration, increased urination.\n\nRare: rash, sensitivity to sunlight.",
    "importantInfo": "Take in the morning to avoid nighttime urination.\n\nMonitor kidney function and electrolytes.\n\nUse caution in diabetes and gout."
  },
  {
    "name": "Insulin",
    "brand": "Humulin, Novorapid, Lantus, Levemir, Apidra.",
    "description": "Insulin is a hormone used to manage blood glucose in people with diabetes. It is classified by action type: rapid-acting, short-acting, intermediate, and long-acting.",
    "dosage": "Highly individualized based on blood glucose levels, diet, and activity.\n\nAdministered subcutaneously — frequency varies by type (e.g., basal-bolus regimens).",
    "sideEffects": "Low blood sugar (hypoglycemia), weight gain, injection site reactions.\n\nRare: allergic reactions, lipodystrophy.",
    "importantInfo": "Rotate injection sites.\n\nMonitor blood sugar regularly.\n\nAlways carry fast-acting sugar and know signs of hypoglycemia."
  },
  {
    "name": "Irbesartan",
    "brand": "Avapro, Aprovel, Karvea, Irovel, Irbetan.",
    "description": "Irbesartan is an angiotensin II receptor blocker (ARB) used to treat high blood pressure and protect kidneys in people with diabetes.",
    "dosage": "Typical starting dose: 150 mg once daily.\n\nMay be increased to 300 mg daily based on response.",
    "sideEffects": "Dizziness, fatigue, low blood pressure.\n\nRare: high potassium, kidney function decline.",
    "importantInfo": "Monitor blood pressure, potassium, and kidney function regularly.\n\nAvoid potassium supplements unless advised.\n\nTake at the same time daily, with or without food."
  },
  {
    "name": "Isosorbide mononitrate and isosorbide dinitrate",
    "brand": "Imdur, Monoket, Isordil, Ismo, Cedocard.",
    "description": "Isosorbide mononitrate and dinitrate are nitrates used to prevent chest pain (angina) by relaxing blood vessels and improving oxygen flow to the heart.",
    "dosage": "Mononitrate: 20–60 mg once or twice daily.\n\nDinitrate: 10–40 mg two to three times daily.\n\nExtended-release formulations are also available.",
    "sideEffects": "Headache, dizziness, flushing, low blood pressure.\n\nTolerance may develop with continuous use.",
    "importantInfo": "Do not use with PDE5 inhibitors (e.g. Viagra).\n\nLeave a nitrate-free interval (usually overnight) to reduce tolerance.\n\nSit or lie down if dizziness occurs."
  },
  {
    "name": "Isotretinoin (Roaccutane)",
    "brand": "Roaccutane, Accutane, Oratane, Isotroin, Claravis.",
    "description": "Isotretinoin (Roaccutane) is a powerful retinoid used to treat severe acne. It reduces oil production and inflammation in the skin.",
    "dosage": "Typically 0.5–1 mg/kg/day for 16–24 weeks.\n\nDosage adjusted based on response and side effects.",
    "sideEffects": "Dry skin/lips, joint pain, mood changes.\n\nSerious: birth defects if used during pregnancy.",
    "importantInfo": "Strict pregnancy prevention required during and after use.\n\nRegular blood tests needed for liver function and lipids.\n\nAvoid vitamin A supplements and limit sun exposure."
  },
  {
    "name": "Isotretinoin (Isotrex)",
    "brand": "Isotrex, Isotrexin (with erythromycin).",
    "description": "Topical isotretinoin is used for mild to moderate acne. It helps to unclog pores and reduce skin inflammation.",
    "dosage": "Apply a thin layer once or twice daily to affected skin.\n\nAvoid broken or irritated skin.",
    "sideEffects": "Skin irritation, redness, peeling, photosensitivity.\n\nMay worsen acne initially before improvement.",
    "importantInfo": "Use sunscreen and avoid excessive sun.\n\nDo not apply near eyes or lips.\n\nWash hands after application and avoid harsh skin products."
  },
  {
    "name": "Ketoconazole",
    "brand": "Nizoral, Ketozole, Xolegel, Extina, Fungarest.",
    "description": "Ketoconazole is an antifungal used topically for fungal skin infections and seborrheic dermatitis, and sometimes orally for serious fungal infections.",
    "dosage": "Topical: apply once or twice daily for 2–4 weeks.\n\nShampoo: 2% used 2–3 times a week.\n\nOral (rarely): 200–400 mg daily under strict supervision.",
    "sideEffects": "Skin irritation (topical), nausea, headache.\n\nOral: liver toxicity, hormonal effects.",
    "importantInfo": "Topical use is generally safe — avoid contact with eyes.\n\nOral form requires liver function monitoring.\n\nDo not use other antifungal creams unless advised."
  },
  {
    "name": "Labetalol",
    "brand": "Trandate, Normodyne, Presolol, Amipress, Labrocol.",
    "description": "Labetalol is a combined alpha- and beta-blocker used to treat high blood pressure, including during pregnancy and hypertensive emergencies.",
    "dosage": "Oral: 100–400 mg twice daily.\n\nIV (for emergencies): 20 mg over 2 minutes, followed by further dosing as needed.",
    "sideEffects": "Dizziness, fatigue, nausea, cold hands/feet.\n\nRare: shortness of breath or slow heart rate.",
    "importantInfo": "Do not stop abruptly — taper gradually.\n\nMonitor blood pressure regularly.\n\nUse caution in asthma or heart conditions."
  },
  {
    "name": "Lactulose",
    "brand": "Duphalac, Lactugal, Enulose, Lactulax, Constulose.",
    "description": "Lactulose is a synthetic sugar used as a laxative to treat constipation and hepatic encephalopathy. It draws water into the colon and softens stools.",
    "dosage": "Constipation: 15–45 ml daily initially, adjusted based on response.\n\nHepatic encephalopathy: up to 30–45 ml three to four times daily.",
    "sideEffects": "Flatulence, bloating, stomach cramps, diarrhea (at high doses).",
    "importantInfo": "May take 1–2 days for full effect.\n\nEnsure adequate fluid intake.\n\nDo not use for more than a few days without medical advice."
  },
  {
    "name": "Lamotrigine",
    "brand": "Lamictal, Lametec, Lamitor, Lamogen, Lamictin.",
    "description": "Lamotrigine is an anticonvulsant used to treat epilepsy and bipolar disorder. It stabilizes electrical activity in the brain.",
    "dosage": "Start with 25 mg once daily, gradually increased over weeks.\n\nMaintenance dose: 100–400 mg/day in divided doses.",
    "sideEffects": "Headache, dizziness, nausea, blurred vision.\n\nSerious: rash, including Stevens-Johnson syndrome.",
    "importantInfo": "Increase dose slowly to reduce risk of rash.\n\nInform your doctor if any skin rash appears.\n\nDo not stop abruptly — risk of seizures."
  },
  {
    "name": "Lansoprazole",
    "brand": "Zoton, Prevacid, Inhibitol, Lanzol, Monolitum.",
    "description": "Lansoprazole is a proton pump inhibitor (PPI) that reduces stomach acid. It’s used for reflux, ulcers, and Helicobacter pylori treatment.",
    "dosage": "Typical adult dose: 15–30 mg once daily.\n\nMay be increased to 30 mg twice daily for severe cases.",
    "sideEffects": "Headache, diarrhea, abdominal pain.\n\nLong-term: vitamin B12 or magnesium deficiency, fracture risk.",
    "importantInfo": "Take 30 minutes before meals.\n\nDo not crush or chew capsules.\n\nUse for shortest duration necessary unless advised otherwise."
  },
  {
    "name": "Latanoprost",
    "brand": "Xalatan, Monopost, Xalacom (combo), Latanest, Latanoprost Sandoz.",
    "description": "Latanoprost is an eye drop used to treat high pressure in the eye caused by glaucoma or ocular hypertension. It increases the drainage of fluid from the eye.",
    "dosage": "1 drop in the affected eye(s) once daily in the evening.\n\nDo not use more than once daily.",
    "sideEffects": "Eye irritation, redness, eyelash growth, darkening of the iris.\n\nRare: blurred vision, eye pain.",
    "importantInfo": "Remove contact lenses before use and wait 15 minutes before reinserting.\n\nContinue using even if symptoms improve.\n\nStore in the refrigerator before opening, room temp after."
  },
  {
    "name": "Lercanidipine",
    "brand": "Zanidip, Lercadip, Zanipress (combo), Lercan, Cardia.",
    "description": "Lercanidipine is a calcium channel blocker used to treat high blood pressure. It works by relaxing blood vessels, reducing strain on the heart.",
    "dosage": "Typical dose: 10–20 mg once daily.\n\nTake 15–30 minutes before a meal.",
    "sideEffects": "Swollen ankles, headache, flushing, dizziness.\n\nRare: palpitations, rash.",
    "importantInfo": "Avoid grapefruit juice — may increase side effects.\n\nMonitor blood pressure regularly.\n\nDo not crush or chew tablets."
  },
  {
    "name": "Letrozole",
    "brand": "Femara, Letoval, Letronat, Oncolet, Letrusan.",
    "description": "Letrozole is an aromatase inhibitor used to treat hormone-sensitive breast cancer in postmenopausal women by lowering estrogen levels.",
    "dosage": "2.5 mg once daily, usually for 5 years.\n\nDuration may vary based on cancer type and risk.",
    "sideEffects": "Hot flushes, fatigue, joint pain, bone thinning.\n\nLess common: dizziness, insomnia.",
    "importantInfo": "Regular bone density scans may be needed.\n\nTake at the same time daily.\n\nTell your doctor if you have liver or bone issues."
  },
  {
    "name": "Levetiracetam",
    "brand": "Keppra, Levipil, Levexa, Levera, Torleva.",
    "description": "Levetiracetam is an anticonvulsant used to treat epilepsy by stabilizing electrical activity in the brain.",
    "dosage": "Initial dose: 500 mg twice daily.\n\nMaintenance: up to 1,500 mg twice daily depending on response.",
    "sideEffects": "Drowsiness, dizziness, fatigue, irritability.\n\nRare: mood changes, suicidal thoughts.",
    "importantInfo": "Do not stop abruptly — may increase seizure risk.\n\nInform doctor of mood changes or behavioral symptoms.\n\nCan be taken with or without food."
  },
  {
    "name": "Levothyroxine",
    "brand": "Eltroxin, Euthyrox, Thyronorm, Eltroxin, Levoxyl.",
    "description": "Levothyroxine is a synthetic form of the thyroid hormone thyroxine (T4), used to treat hypothyroidism by restoring normal hormone levels.",
    "dosage": "Initial dose: 25–50 mcg once daily.\n\nMaintenance: 50–200 mcg daily, adjusted based on TSH levels.",
    "sideEffects": "Palpitations, anxiety, weight loss, heat intolerance.\n\nOverdose: symptoms of hyperthyroidism.",
    "importantInfo": "Take on an empty stomach, 30–60 minutes before breakfast.\n\nDo not take with calcium, iron, or antacids — may affect absorption.\n\nMonitor thyroid levels regularly."
  },
  {
    "name": "Lidocaine",
    "brand": "Xylocaine, Lignocaine, Lidoderm, Versatis, AneCream.",
    "description": "Lidocaine is a local anesthetic used to numb tissue in a specific area. It is available in creams, gels, sprays, injections, and patches.",
    "dosage": "Topical: apply thinly as directed.\n\nInjections: administered by healthcare professional based on procedure.",
    "sideEffects": "Tingling, redness, swelling at site.\n\nRare: dizziness, allergic reaction, irregular heartbeat (with large doses).",
    "importantInfo": "Use only on intact skin unless advised.\n\nAvoid exceeding maximum dose to prevent toxicity.\n\nWash hands after application unless treating hands."
  },
  {
    "name": "Linagliptin",
    "brand": "Tradjenta, Trajenta, Ondero, Trazenta.",
    "description": "Linagliptin is a DPP-4 inhibitor used to treat type 2 diabetes by increasing insulin secretion and decreasing glucagon levels in the blood.",
    "dosage": "5 mg once daily, with or without food.\n\nNo dose adjustment required in renal impairment.",
    "sideEffects": "Nasopharyngitis, headache, cough.\n\nRare: pancreatitis, joint pain, allergic reactions.",
    "importantInfo": "Monitor blood sugar regularly.\n\nInform your doctor of severe abdominal pain or rash.\n\nNot for type 1 diabetes or ketoacidosis."
  },
  {
    "name": "Lisinopril",
    "brand": "Zestril, Prinivil, Linipril, Lisoril, Hipril.",
    "description": "Lisinopril is an ACE inhibitor used to treat high blood pressure, heart failure, and after heart attacks. It relaxes blood vessels and lowers strain on the heart.",
    "dosage": "Initial dose: 5–10 mg once daily.\n\nMaintenance: 10–40 mg once daily depending on condition and response.",
    "sideEffects": "Dry cough, dizziness, low blood pressure.\n\nRare: angioedema, high potassium, kidney dysfunction.",
    "importantInfo": "Monitor kidney function and potassium.\n\nAvoid potassium supplements unless advised.\n\nDo not take during pregnancy — risk to fetus."
  },
  {
    "name": "Lithium",
    "brand": "Priadel, Camcolit, Liskonum, Lithonate, Li-liquid.",
    "description": "Lithium is a mood stabilizer used to treat bipolar disorder and sometimes recurrent depression. It helps reduce mood swings and prevent manic or depressive episodes.",
    "dosage": "Highly individualized based on blood levels.\n\nTypical maintenance: 400–1,200 mg daily in divided doses.",
    "sideEffects": "Tremor, thirst, nausea, weight gain.\n\nToxicity: confusion, vomiting, unsteady gait, seizures.",
    "importantInfo": "Requires regular blood monitoring for levels, kidney, and thyroid function.\n\nMaintain consistent salt and fluid intake.\n\nAvoid NSAIDs and dehydration — can increase lithium levels."
  },
  {
    "name": "Loperamide (Imodium)",
    "brand": "Imodium, Diamode, Lopex, Arret, Norimode.",
    "description": "Loperamide is used to treat diarrhea by slowing intestinal movement and reducing stool frequency.",
    "dosage": "Initial dose: 4 mg, followed by 2 mg after each loose stool.\n\nMaximum: 16 mg per day in adults.",
    "sideEffects": "Constipation, nausea, stomach cramps, dizziness.\n\nRare: bowel obstruction, drowsiness.",
    "importantInfo": "Do not use for more than 2 days unless advised.\n\nAvoid if diarrhea is due to infection or fever.\n\nDrink fluids to prevent dehydration."
  },
  {
    "name": "Loratadine (Clarityn)",
    "brand": "Clarityn, Lorin, Lorfast, Alavert, Claratyne.",
    "description": "Loratadine is a non-drowsy antihistamine used for hay fever, allergies, and hives. It blocks the action of histamine to reduce symptoms.",
    "dosage": "Adults and children over 12: 10 mg once daily.\n\nChildren 2–12: 5 mg once daily (based on weight).",
    "sideEffects": "Headache, fatigue, dry mouth.\n\nRare: allergic reaction or drowsiness.",
    "importantInfo": "Usually does not cause drowsiness.\n\nCan be taken with or without food.\n\nAvoid taking more than directed."
  },
  {
    "name": "Lorazepam",
    "brand": "Ativan, Temesta, Loreev, Lorans, Alzepam.",
    "description": "Lorazepam is a benzodiazepine used to treat anxiety, insomnia, and seizures. It has a calming effect on the brain.",
    "dosage": "Anxiety: 1–4 mg daily in divided doses.\n\nSleep: 1–2 mg at bedtime.\n\nIV: used for acute seizures or agitation in hospital.",
    "sideEffects": "Drowsiness, dizziness, weakness.\n\nRisk of dependence, withdrawal, confusion (especially in elderly).",
    "importantInfo": "Short-term use only unless advised.\n\nAvoid alcohol and driving.\n\nTaper gradually to avoid withdrawal symptoms."
  },
  {
    "name": "Losartan",
    "brand": "Cozaar, Repace, Losacar, Angizaar, Preszar.",
    "description": "Losartan is an angiotensin II receptor blocker (ARB) used to treat high blood pressure, heart failure, and kidney protection in diabetes.",
    "dosage": "Typical dose: 50 mg once daily.\n\nMay be increased to 100 mg daily based on response.",
    "sideEffects": "Dizziness, fatigue, low blood pressure.\n\nRare: high potassium, kidney function decline.",
    "importantInfo": "Monitor blood pressure, kidney function, and potassium.\n\nAvoid potassium supplements or salt substitutes unless advised.\n\nTake at the same time each day."
  },
  {
    "name": "Lymecycline",
    "brand": "Tetralysal, Lymecin, Cyclidox, Aceclin, Lycycline.",
    "description": "Lymecycline is a tetracycline antibiotic commonly used to treat acne and various bacterial infections including chest and urinary infections.",
    "dosage": "Standard dose: 408 mg once daily.\n\nDuration depends on condition — acne typically treated for 8–12 weeks.",
    "sideEffects": "Nausea, abdominal pain, diarrhea, sun sensitivity.\n\nRare: allergic reactions, fungal infections.",
    "importantInfo": "Take with a full glass of water.\n\nAvoid milk, iron, or antacids near dosing time.\n\nUse sun protection and avoid prolonged exposure."
  },
  {
    "name": "Macrogol",
    "brand": "Movicol, Laxido, CosmoCol, Molaxole, Idrolax.",
    "description": "Macrogol is a laxative used to treat constipation by retaining water in the bowel to soften stools and stimulate movement.",
    "dosage": "1–3 sachets daily for constipation.\n\nHigher doses (up to 8 sachets) for fecal impaction — under medical advice.",
    "sideEffects": "Bloating, gas, stomach discomfort.\n\nRare: electrolyte imbalance with prolonged use.",
    "importantInfo": "Dissolve powder in water before use.\n\nCan be taken long term for chronic constipation.\n\nMaintain good hydration while using."
  },
  {
    "name": "Mebendazole",
    "brand": "Vermox, Ovex, Antiox, Wormstop, Combantrin-M.",
    "description": "Mebendazole is an antiparasitic used to treat intestinal worm infections such as threadworm, roundworm, and whipworm.",
    "dosage": "Single 100 mg dose for threadworm.\n\nRepeat in 2–3 weeks if needed.\n\nOther infections may require twice-daily dosing for 3 days.",
    "sideEffects": "Abdominal pain, diarrhea, gas.\n\nRare: rash, allergic reactions, liver changes.",
    "importantInfo": "Treat all household members for threadworm.\n\nMaintain hygiene and wash bedding during treatment.\n\nAvoid in pregnancy unless essential."
  },
  {
    "name": "Mebeverine",
    "brand": "Colofac, Duspatalin, Mebiz, Inteston, Spasmomen.",
    "description": "Mebeverine is an antispasmodic used to relieve abdominal cramps, bloating, and discomfort associated with irritable bowel syndrome (IBS).",
    "dosage": "135 mg tablets: one tablet three times daily before meals.\n\nModified-release capsules: 200 mg twice daily.",
    "sideEffects": "Rare: allergic reactions (rash, itching, swelling).\n\nGenerally well tolerated.",
    "importantInfo": "Do not crush or chew modified-release capsules.\n\nContinue taking regularly for consistent relief.\n\nSeek medical help for any signs of allergic reaction."
  },
  {
    "name": "Medroxyprogesterone",
    "brand": "Provera, Depo-Provera, Sayana Press, Cycrin, Farlutal.",
    "description": "Medroxyprogesterone is a progestin hormone used for contraception, regulating menstrual cycles, or managing endometriosis and abnormal bleeding.",
    "dosage": "Oral: 5–10 mg daily for 5–10 days per cycle.\n\nInjection (Depo-Provera): 150 mg every 12 weeks.",
    "sideEffects": "Weight gain, breast tenderness, mood changes, menstrual irregularities.\n\nLong-term injection use: decreased bone density.",
    "importantInfo": "May take time for periods to return after stopping.\n\nCalcium and vitamin D intake important during use.\n\nReport unusual bleeding or severe mood changes."
  },
  {
    "name": "Melatonin",
    "brand": "Circadin, Meloset, Slenyto, Restivit, Dormin.",
    "description": "Melatonin is a hormone that regulates sleep-wake cycles. It is used to treat insomnia, jet lag, and delayed sleep phase disorder.",
    "dosage": "2–5 mg 1–2 hours before bedtime.\n\nDose may vary depending on condition and age.",
    "sideEffects": "Drowsiness, vivid dreams, headache, nausea.\n\nRare: mood changes or confusion.",
    "importantInfo": "Avoid alcohol or caffeine near bedtime.\n\nBest taken at the same time each night.\n\nNot recommended for long-term use unless advised."
  },
  {
    "name": "Memantine",
    "brand": "Ebixa, Axura, Namenda, Memanxa, Marixino.",
    "description": "Memantine is used to treat moderate to severe Alzheimer's disease. It works by regulating glutamate to improve memory, attention, and behavior.",
    "dosage": "Starting dose: 5 mg once daily, increased gradually to 20 mg/day.\n\nUsually taken in divided doses.",
    "sideEffects": "Dizziness, headache, confusion, constipation.\n\nMay cause hallucinations or agitation in some patients.",
    "importantInfo": "Take with or without food.\n\nUse caution in patients with seizures or kidney issues.\n\nReport any sudden changes in mood or behavior."
  },
  {
    "name": "Mesalazine",
    "brand": "Asacol, Pentasa, Mezavant, Salofalk, Ipocol.",
    "description": "Mesalazine is an anti-inflammatory drug used to treat and prevent flare-ups of ulcerative colitis and Crohn's disease by reducing inflammation in the colon.",
    "dosage": "Typical oral dose: 2–4 g daily in divided doses.\n\nRectal formulations (suppositories/enemas) may be used for distal disease.",
    "sideEffects": "Headache, nausea, abdominal pain, flatulence.\n\nRare: kidney issues, allergic rash, pancreatitis.",
    "importantInfo": "Regular kidney function monitoring is advised.\n\nDo not crush or chew modified-release tablets.\n\nInform your doctor if you develop new abdominal pain or rash."
  },
  {
    "name": "Metformin",
    "brand": "Glucophage, Riomet, Glumetza, Fortamet, Obimet.",
    "description": "Metformin is a first-line medication for type 2 diabetes. It lowers blood sugar by reducing glucose production in the liver and improving insulin sensitivity.",
    "dosage": "Initial: 500 mg once or twice daily with meals.\n\nMaintenance: up to 2,000 mg/day in divided doses.",
    "sideEffects": "Nausea, diarrhea, stomach upset.\n\nRare: lactic acidosis (serious).",
    "importantInfo": "Take with food to reduce GI symptoms.\n\nDo not use in severe kidney or liver disease.\n\nTemporarily stop before major surgery or contrast imaging."
  },
  {
    "name": "Methadone",
    "brand": "Physeptone, Methadose, Diskets, Dolophine, Metadon.",
    "description": "Methadone is a long-acting opioid used to treat pain and as part of opioid substitution therapy for heroin or morphine addiction.",
    "dosage": "Opioid dependence: 10–30 mg daily, titrated based on withdrawal symptoms.\n\nPain: 2.5–10 mg every 8–12 hours as needed.",
    "sideEffects": "Drowsiness, constipation, sweating, dry mouth.\n\nRisk of dependence, respiratory depression, QT prolongation.",
    "importantInfo": "Dose changes must be made cautiously — long half-life.\n\nAvoid alcohol and sedatives.\n\nECG monitoring may be required for long-term use."
  },
  {
    "name": "Methotrexate",
    "brand": "Methoblastin, Maxtrex, Trexall, Rheumatrex, Nordimet.",
    "description": "Methotrexate is an immunosuppressant used to treat autoimmune conditions (like rheumatoid arthritis, psoriasis) and certain cancers.",
    "dosage": "Typically 7.5–25 mg once weekly (oral, subcutaneous, or IM).\n\nAlways taken once a week, not daily.",
    "sideEffects": "Nausea, mouth ulcers, fatigue, low blood cell counts.\n\nSerious: liver toxicity, lung issues, infection risk.",
    "importantInfo": "Take folic acid to reduce side effects.\n\nRegular blood tests required.\n\nDo not take NSAIDs or alcohol without medical advice."
  },
  {
    "name": "Methylphenidate",
    "brand": "Ritalin, Concerta, Medikinet, Equasym, Metadate.",
    "description": "Methylphenidate is a stimulant used to treat ADHD and narcolepsy by increasing levels of dopamine and norepinephrine in the brain.",
    "dosage": "Immediate-release: 5–20 mg 2–3 times daily.\n\nModified-release: 18–72 mg once daily depending on brand and age.",
    "sideEffects": "Loss of appetite, insomnia, increased heart rate, anxiety.\n\nRare: tics, mood changes, growth suppression in children.",
    "importantInfo": "Take in the morning to avoid insomnia.\n\nMonitor growth in children.\n\nAvoid abrupt discontinuation without medical advice."
  },
  {
    "name": "Metoclopramide",
    "brand": "Maxolon, Reglan, Pramin, Gastrobid, Clopra.",
    "description": "Metoclopramide is used to treat nausea, vomiting, and delayed stomach emptying. It increases stomach and intestinal movement.",
    "dosage": "10 mg up to three times daily.\n\nShort-term use (max 5 days) is recommended.",
    "sideEffects": "Drowsiness, restlessness, diarrhea.\n\nRare: movement disorders (especially in long-term use).",
    "importantInfo": "Limit use to short term due to risk of extrapyramidal symptoms.\n\nAvoid alcohol and sedatives.\n\nReport any muscle stiffness or unusual movements."
  },
  {
    "name": "Metoprolol",
    "brand": "Lopressor, Betaloc, Toprol-XL, Neobloc, Minax.",
    "description": "Metoprolol is a beta-blocker used to treat high blood pressure, angina, and heart rhythm disorders. It slows the heart rate and reduces blood pressure.",
    "dosage": "Typical dose: 50–100 mg once or twice daily.\n\nExtended-release forms available for once-daily dosing.",
    "sideEffects": "Fatigue, dizziness, cold extremities, low heart rate.\n\nMay mask symptoms of low blood sugar in diabetics.",
    "importantInfo": "Do not stop abruptly — taper off under supervision.\n\nTake with food to improve absorption.\n\nMonitor heart rate and blood pressure regularly."
  },
  {
    "name": "Metronidazole",
    "brand": "Flagyl, Metrogel, Metrogyl, Nidazole, Rozex.",
    "description": "Metronidazole is an antibiotic and antiprotozoal used to treat bacterial vaginosis, pelvic infections, dental infections, and rosacea.",
    "dosage": "Oral: 400–500 mg two to three times daily.\n\nTopical and vaginal formulations used once or twice daily.",
    "sideEffects": "Metallic taste, nausea, dizziness.\n\nRare: seizures, peripheral neuropathy.",
    "importantInfo": "Avoid alcohol during and for 48 hours after use — may cause severe reaction.\n\nTake with food if stomach upset occurs.\n\nComplete the course even if symptoms improve."
  },
  {
    "name": "Mirabegron",
    "brand": "Betmiga, Myrbetriq, Mirago, Betriq, Berogran.",
    "description": "Mirabegron is used to treat overactive bladder symptoms like urgency, frequency, and urge incontinence. It relaxes the bladder muscle to increase storage capacity.",
    "dosage": "Typical adult dose: 50 mg once daily.\n\nStart with 25 mg if needed, especially in elderly or with renal impairment.",
    "sideEffects": "Increased blood pressure, urinary tract infections, headache.\n\nRare: fast heart rate, allergic reactions.",
    "importantInfo": "Check blood pressure regularly during treatment.\n\nDo not crush or chew the tablets.\n\nMay take a few weeks to see full benefit."
  },
  {
    "name": "Mirtazapine",
    "brand": "Zispin, Remeron, Mirtaz, Avanza, Mirzaten.",
    "description": "Mirtazapine is an antidepressant used for depression, anxiety, and sleep disorders. It works by affecting serotonin and norepinephrine levels.",
    "dosage": "Starting dose: 15 mg at bedtime.\n\nMaintenance: 15–45 mg daily, usually taken at night due to sedative effects.",
    "sideEffects": "Drowsiness, increased appetite, weight gain, dry mouth.\n\nMay cause vivid dreams or dizziness.",
    "importantInfo": "Avoid alcohol — may increase drowsiness.\n\nDo not stop suddenly — taper under supervision.\n\nMay take 2–4 weeks to feel full benefit."
  },
  {
    "name": "Molnupiravir (Lagevrio)",
    "brand": "Lagevrio.",
    "description": "Molnupiravir is an antiviral used to treat mild to moderate COVID-19 in high-risk adults to reduce the risk of hospitalization.",
    "dosage": "800 mg (four 200 mg capsules) every 12 hours for 5 days.\n\nShould be started within 5 days of symptom onset.",
    "sideEffects": "Diarrhea, nausea, dizziness.\n\nGenerally well tolerated in short courses.",
    "importantInfo": "Not recommended in pregnancy.\n\nSwallow capsules whole with water.\n\nComplete the full course even if symptoms improve."
  },
  {
    "name": "Mometasone",
    "brand": "Nasonex, Elocon, Asmanex, Momate, Furovate.",
    "description": "Mometasone is a corticosteroid used to treat asthma, allergic rhinitis, and inflammatory skin conditions. It reduces inflammation and itching.",
    "dosage": "Nasal spray: 2 sprays per nostril once daily.\n\nInhaler: 220–440 mcg once or twice daily.\n\nTopical: apply once daily to affected area.",
    "sideEffects": "Dry nose or throat, sore throat, skin thinning (topical).\n\nRare: nosebleeds, headache.",
    "importantInfo": "Rinse mouth after inhaler use to prevent thrush.\n\nDo not use for longer than recommended without review.\n\nAvoid eyes when using topical form."
  },
  {
    "name": "Montelukast",
    "brand": "Singulair, Montelo-10, Lukotas, Montek, Airlukast.",
    "description": "Montelukast is a leukotriene receptor antagonist used to prevent asthma symptoms and treat seasonal allergies. It works by blocking inflammation-causing chemicals.",
    "dosage": "Adults: 10 mg once daily in the evening.\n\nChildren: 4–5 mg once daily depending on age.",
    "sideEffects": "Headache, abdominal pain, tiredness.\n\nRare: mood changes, sleep disturbances.",
    "importantInfo": "Take at the same time each day.\n\nNot a rescue medicine — do not use for sudden asthma attacks.\n\nDiscuss mood-related side effects with your doctor."
  },
  {
    "name": "Morphine",
    "brand": "MST Continus, Sevredol, Oramorph, Zomorph, MXL.",
    "description": "Morphine is a strong opioid used to treat moderate to severe pain. It works by blocking pain signals in the brain and spinal cord.",
    "dosage": "Immediate-release: 5–20 mg every 4 hours as needed.\n\nModified-release: 10–60 mg twice daily based on pain severity.",
    "sideEffects": "Constipation, drowsiness, nausea, itching.\n\nSerious: respiratory depression, dependence, confusion.",
    "importantInfo": "Avoid alcohol and driving.\n\nUse laxatives to prevent constipation.\n\nTaper slowly if discontinuing after long-term use."
  },
  {
    "name": "Naproxen",
    "brand": "Naprosyn, Aleve, Naprelan, Synflex, Feminax Ultra.",
    "description": "Naproxen is a nonsteroidal anti-inflammatory drug (NSAID) used to relieve pain, inflammation, and stiffness in arthritis, period pain, and injury.",
    "dosage": "Typical dose: 250–500 mg twice daily.\n\nMaximum daily dose: 1,000 mg.",
    "sideEffects": "Stomach pain, heartburn, dizziness.\n\nLong-term: ulcers, kidney issues, cardiovascular risks.",
    "importantInfo": "Take with food or milk to protect your stomach.\n\nAvoid combining with other NSAIDs.\n\nInform your doctor if you have stomach or heart conditions."
  },
  {
    "name": "Nefopam",
    "brand": "Acupan, Nefopam Hydrochloride, Fenazox, Neflam.",
    "description": "Nefopam is a non-opioid painkiller used for moderate pain. It works by blocking pain signals in the brain but is not anti-inflammatory.",
    "dosage": "Oral: 30–90 mg three times daily.\n\nIV (hospital use): up to 20 mg every 4–6 hours.",
    "sideEffects": "Nausea, dizziness, dry mouth, sweating.\n\nMay cause drowsiness or palpitations.",
    "importantInfo": "Avoid alcohol and operating machinery.\n\nDo not exceed recommended dose.\n\nNot typically used long-term."
  },
  {
    "name": "Nicorandil",
    "brand": "Ikorel, Angedil, Corodil, Nicoran, Nicorandil Accord.",
    "description": "Nicorandil is used to prevent chest pain (angina) by widening blood vessels and improving blood flow to the heart.",
    "dosage": "Initial dose: 5–10 mg twice daily.\n\nMaintenance: 10–20 mg twice daily depending on tolerance.",
    "sideEffects": "Headache, flushing, dizziness.\n\nRare: mouth ulcers, low blood pressure.",
    "importantInfo": "Do not stop suddenly without medical advice.\n\nAvoid use with PDE5 inhibitors (e.g., sildenafil).\n\nReport persistent ulcers or bleeding."
  },
  {
    "name": "Nifedipine",
    "brand": "Adalat, Nifediac, Procardia, Tenif, Coracten.",
    "description": "Nifedipine is a calcium channel blocker used to treat high blood pressure and angina. It relaxes and widens blood vessels.",
    "dosage": "Typical modified-release: 30–60 mg once daily.\n\nDo not use immediate-release for long-term blood pressure control.",
    "sideEffects": "Swollen ankles, headache, flushing, palpitations.\n\nRare: gum overgrowth.",
    "importantInfo": "Do not chew or crush modified-release tablets.\n\nAvoid grapefruit juice.\n\nMonitor blood pressure regularly."
  },
  {
    "name": "Nitrofurantoin",
    "brand": "Macrobid, Macrodantin, Furadantin, Nifuran, Uvamin.",
    "description": "Nitrofurantoin is an antibiotic used to treat and prevent urinary tract infections. It works best in acidic urine environments.",
    "dosage": "Treatment: 100 mg twice daily for 3–7 days.\n\nPrevention: 50–100 mg once daily at night.",
    "sideEffects": "Nausea, headache, urine discoloration (brown).\n\nRare: lung or liver problems with long-term use.",
    "importantInfo": "Take with food or milk.\n\nStay hydrated and complete the course.\n\nDo not use if you have kidney problems (low eGFR)."
  },
  {
    "name": "Nortriptyline",
    "brand": "Pamelor, Allegron, Nortrilen, Sensoval, Norpress.",
    "description": "Nortriptyline is a tricyclic antidepressant used to treat depression, nerve pain, and sometimes migraines or sleep disorders.",
    "dosage": "Depression: 25–75 mg daily, typically at bedtime.\n\nNerve pain: lower doses (10–25 mg) initially.",
    "sideEffects": "Drowsiness, dry mouth, constipation, weight gain.\n\nRare: heart rhythm issues, confusion in elderly.",
    "importantInfo": "Do not stop suddenly.\n\nAvoid alcohol and sedatives.\n\nMay take 2–4 weeks to see full benefit."
  },
  {
    "name": "Nystatin",
    "brand": "Mycostatin, Nystan, Nilstat, Fungistatin, Nyaderm.",
    "description": "Nystatin is an antifungal medication used to treat infections caused by Candida, such as oral thrush, skin infections, and diaper rash.",
    "dosage": "Oral suspension: 100,000 units four times daily, swish and swallow.\n\nTopical: apply to affected area 2–3 times daily.",
    "sideEffects": "Mild nausea, diarrhea (oral).\n\nTopical: skin irritation or rash.",
    "importantInfo": "Complete the full course even if symptoms improve.\n\nShake oral suspension well before use.\n\nDo not use topical form on broken skin unless directed."
  },
  {
    "name": "Oestrogen",
    "brand": "Premarin, Elleste Solo, Progynova, Estradot, Evorel.",
    "description": "Oestrogen is a hormone used in hormone replacement therapy (HRT) to treat menopausal symptoms and in contraception. It can be taken orally, topically, or as patches.",
    "dosage": "Depends on formulation: oral (0.5–2 mg daily), patch (applied twice weekly), gel (daily).\n\nUsed continuously or cyclically.",
    "sideEffects": "Breast tenderness, bloating, nausea, headache.\n\nIncreased risk of blood clots or stroke with long-term use.",
    "importantInfo": "Use at the lowest effective dose for the shortest duration.\n\nReport unusual bleeding, breast lumps, or leg swelling.\n\nCombine with progesterone if uterus is intact (unless advised)."
  },
  {
    "name": "Olanzapine",
    "brand": "Zyprexa, Oliza, Lanzek, Olanex, Zolafren.",
    "description": "Olanzapine is an atypical antipsychotic used to treat schizophrenia, bipolar disorder, and acute manic episodes.",
    "dosage": "Starting dose: 5–10 mg once daily.\n\nMaintenance: 10–20 mg daily depending on response.",
    "sideEffects": "Weight gain, drowsiness, increased appetite, dry mouth.\n\nRare: high blood sugar, cholesterol changes, movement disorders.",
    "importantInfo": "Monitor weight, blood sugar, and lipids.\n\nAvoid alcohol.\n\nMay take several weeks for full effect."
  },
  {
    "name": "Olmesartan",
    "brand": "Benicar, Olmetec, Olmecip, Olmesar, Cardosal.",
    "description": "Olmesartan is an angiotensin II receptor blocker (ARB) used to treat high blood pressure by relaxing blood vessels.",
    "dosage": "Typical starting dose: 10–20 mg once daily.\n\nMaintenance: up to 40 mg daily.",
    "sideEffects": "Dizziness, fatigue, back pain.\n\nRare: kidney issues, high potassium, severe diarrhea (sprue-like enteropathy).",
    "importantInfo": "Monitor kidney function and potassium.\n\nAvoid potassium supplements or NSAIDs unless advised.\n\nTake at the same time daily."
  },
  {
    "name": "Omeprazole",
    "brand": "Losec, Prilosec, Omez, Zegerid, Omep.",
    "description": "Omeprazole is a proton pump inhibitor (PPI) used to treat acid reflux, indigestion, stomach ulcers, and H. pylori infection. It reduces stomach acid production.",
    "dosage": "Typical dose: 20–40 mg once daily.\n\nMay be taken twice daily for severe conditions or H. pylori treatment.",
    "sideEffects": "Headache, abdominal pain, nausea, flatulence.\n\nLong-term: low magnesium, B12 deficiency, fracture risk.",
    "importantInfo": "Take 30–60 minutes before meals.\n\nDo not crush or chew capsules.\n\nUse the lowest effective dose for the shortest duration."
  },
  {
    "name": "Oxybutynin",
    "brand": "Ditropan, Lyrinel, Oxytrol, Kentera, Cystrin.",
    "description": "Oxybutynin is used to treat overactive bladder and urinary incontinence by relaxing bladder muscles to reduce urgency and frequency.",
    "dosage": "Immediate-release: 2.5–5 mg two or three times daily.\n\nExtended-release: 5–10 mg once daily.\n\nPatches and topical gels also available.",
    "sideEffects": "Dry mouth, constipation, blurred vision, drowsiness.\n\nRare: confusion, especially in elderly.",
    "importantInfo": "Stay hydrated to manage dry mouth.\n\nAvoid overheating — may reduce ability to sweat.\n\nUse caution in glaucoma or older adults."
  },
  {
    "name": "Oxycodone",
    "brand": "OxyContin, Oxynorm, Endone, Roxicodone, Longtec.",
    "description": "Oxycodone is a strong opioid painkiller used for moderate to severe pain. It alters pain perception in the brain and spinal cord.",
    "dosage": "Immediate-release: 5–20 mg every 4–6 hours as needed.\n\nModified-release: 10–80 mg twice daily, adjusted individually.",
    "sideEffects": "Constipation, nausea, drowsiness, dizziness.\n\nSerious: respiratory depression, dependence, low blood pressure.",
    "importantInfo": "Avoid alcohol and sedatives.\n\nUse laxatives to prevent constipation.\n\nDo not crush or chew modified-release tablets."
  },
  {
    "name": "Pantoprazole",
    "brand": "Protonix, Somac, Pantodac, Panum, Pantorc.",
    "description": "Pantoprazole is a proton pump inhibitor (PPI) used to treat acid reflux, GERD, ulcers, and Zollinger-Ellison syndrome by reducing stomach acid.",
    "dosage": "20–40 mg once daily.\n\nMay be increased to 40 mg twice daily for severe conditions.",
    "sideEffects": "Headache, diarrhea, nausea, abdominal pain.\n\nLong-term: magnesium or vitamin B12 deficiency.",
    "importantInfo": "Take 30–60 minutes before meals.\n\nSwallow tablets whole with water.\n\nRegularly review need for long-term use."
  }
]
